[
    {
        "Date": "2025-02-18",
        "Company": "MeridianLink Inc.",
        "Ticker": "MLNK",
        "Source Name": "morningstar.com",
        "Source URL": "https://www.morningstar.com/news/business-wire/20250211910741/meridianlink-recognized-with-housingwire-2025-tech100-mortgage-award-for-the-fifth-consecutive-year",
        "Extracted Text": "MeridianLink Recognized with HousingWire 2025 Tech100 Mortgage Award for the Fifth Consecutive Year MeridianLink, Inc. (NYSE: MLNK), a leading provider of modern software platforms for financial institutions and consumer reporting agencies, today announced its selection as a winner of the 2025 HousingWire Tech100 Mortgage Award. The MeridianLink® Mortgage loan origination system was recognized for its cutting-edge configurability, continued advancements in borrower experience, and unparalleled ability to help financial institutions streamline operations while reducing origination times and costs. Now in its thirteenth year, the Tech100 program recognizes the most innovative and impactful organizations in the mortgage and real estate industries. The annual list serves as a resource for housing professionals seeking technology partners that address the evolving challenges of the mortgage lending landscape. \"Technology is at the core of progress in the housing industry,” said Clayton Collins, CEO of HousingWire parent company HW Media. “The companies recognized in this year’s Tech100 awards are leading innovation and delivering real-world impact to drive faster and more efficient processes in mortgage lending, capital markets, servicing and real estate. We're seeing lending and real estate organizations separate from the pack through the development and implementation of technology that bolsters client experience, employee productivity and process automation.\" As digital solutions play an increasingly critical role in the mortgage industry, the Tech100 program continues to spotlight the most impactful innovations. For the sixth consecutive year, HousingWire has recognized leaders in two distinct categories—Tech100 Mortgage and Tech100 Real Estate—highlighting achievements across both sectors. “We are honored to be recognized with HousingWire’s prestigious Tech100 Award for the fifth year in a row,” said JP Kelly, SVP of Mortgage at MeridianLink®. “This level of excellence, sustained over years, reflects the dedication of our team to continuously enhance our mortgage solutions and provide the most innovative, seamless digital experiences to our customers and their end-users. We are excited to carry this momentum into the rest of 2025 as we continue enabling financial institutions of all sizes to identify growth opportunities, effectively scale up, and better support their consumers.” ABOUT MERIDIANLINK MeridianLink® (NYSE: MLNK) empowers financial institutions and consumer reporting agencies to drive efficient growth. MeridianLink’s cloud-based digital lending, account opening, background screening, and data verification solutions leverage shared intelligence from a unified data platform, MeridianLink® One, to enable customers of all sizes to identify growth opportunities, effectively scale up, and support compliance efforts, all while powering an enhanced experience for staff and consumers alike. For more than 25 years, MeridianLink has prioritized the democratization of lending for consumers, businesses, and communities. Learn more at www.meridianlink.com. Media Contact: Sydney Wishnow (508) 808-9060 meridianlinkPR@clyde.us View source version on businesswire.com: https://www.businesswire.com/news/home/20250211910741/en/ Transparency is how we protect the integrity of our work and keep empowering investors to achieve their goals and dreams. And we have unwavering standards for how we keep that integrity intact, from our research and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. © Copyright 2025 Morningstar, Inc. All rights reserved. Dow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time."
    },
    {
        "Date": "2025-02-18",
        "Company": "MeridianLink Inc.",
        "Ticker": "MLNK",
        "Source Name": "fool.com",
        "Source URL": "https://www.fool.com/earnings/call-transcripts/2022/05/13/meridianlink-inc-mlnk-q1-2022-earnings-call-transc/",
        "Extracted Text": "MLNK earnings call for the period ending March 31, 2022. IMAGE SOURCE: THE MOTLEY FOOL. MeridianLink, Inc. (MLNK -1.96%) Q1 2022 Earnings Call May 12, 2022, 5:00 p.m. ET Operator Ladies and gentlemen, thank you for standby, and welcome to MeridianLink's first quarter 2022 earnings call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to turn the conference over to your first speaker today, Erik Schneider, head of investor relations. Erik, please go ahead. Erik Schneider -- Head of Investor Relations Good afternoon, and welcome to MeridianLink's first quarter fiscal year 2022 earnings call. We will be discussing the results announced in our press release issued after the market closed today. With me are MeridianLink's chief executive officer, Nicolaas Vlok, and chief financial officer, Chad Martin. Before we begin, I'd like to remind you that today's conference call will include forward-looking statements based on the company's current expectations. These forward-looking statements are subject to a number of significant risks and uncertainties, and our actual results may differ materially. For a discussion of factors that could affect our future financial results and business, please refer to the disclosure in today's earnings release, and the other reports and filings we file from time to time with the Securities and Exchange Commission. All our statements are made based on information available to us as of today, and except as required by law, we assume no obligation to update any such statements. During the call, we will also refer to both GAAP and non-GAAP financial measures. You can find the reconciliation of our GAAP to non-GAAP measures included in our press release, which is posted to the investor relations section of our website. With that, let me turn the call over to Nicolaas. Nicolaas Vlok -- Chief Executive Officer Thank you, Erik, and good afternoon, everyone. Thank you all for joining us for our first quarter 2022 earnings call. I want to thank the entire MeridianLink team for helping us achieve another strong quarter, with continued growth and momentum throughout the business. Soon, Chad will discuss our Q1 financial performance, but I would like to provide an overview of what contributed to the quarter's solid performance. Q1 showed strong momentum outside the expected slowing in mortgage-related revenues as we've continued to improve our solutions, enabling our customers to perform well in the face of a normalizing market. We have maintained investments in our product and team, added partner integrations and increased the pace of customers going live on the platform. As a result, MeridianLink exceeded guidance again in Q1, with GAAP revenue up 7% year over year to $72.8 million and 47% adjusted EBITDA margins. I want to take a few minutes to discuss three particular areas of strength from the quarter. First, our continued offering expansion; second, our robust cross-sell engine; and third, our investments to more quickly onboard customers. These three important areas helped fuel our first quarter and I'm excited and confident in our continuing trajectory of delivering on our commitments to our customers, our employees, and our investors. First, offering expansion. Let's start by taking a look at new capabilities. We have a demonstrated history of introducing incremental product innovations on a continuous basis to help our customers succeed serving consumers. Today, I want to highlight two new products we are offering to customers, Engage and Atlas from StreetShares and two new partner relationships we are making available, Social Intelligence and Verafin. After a very successful Q4 beta with great customer feedback, we began 2022 by announcing the general availability of MeridianLink Engage, which builds on the foundation of our Saylent acquisition and the execution of our go-to-market plan. MeridianLink Engage enables financial institutions to increase engagement and profitability through data-driven lending campaigns. The Q1 launch of MeridianLink Engage is generating significant interest, with pipeline continuing to build as it provides our customers additional ways to capture incremental wallet share, while they delight consumers with better lending experiences. For example, one early credit union customer has leveraged MeridianLink Engage to target active members with auto loans elsewhere, driving auto loan refinance activity at their institution, contributing to a nearly 300% ROI measured to date on the campaign. The success of the Saylent acquisition and Engage launch highlights our ability to identify strategic acquisition opportunities and complete successful technological integrations to build upon our powerful platform. We pass on many more acquisition opportunities than we close, as we seek the right combination of a strategic fit, timing, and value. On our previous call in March, we announced that we had entered into an agreement to acquire StreetShares to expand our small business lending offering to banks and credit unions. Bought by experienced business bankers, the offering specifically addresses the key challenges in small business risk assessment and decisioning to meet the financing needs of small businesses efficiently. I'm excited to confirm that we closed the transaction on April 1 and have been working with our new team members to execute our integration plans to provide this additional functionality as part of our MeridianLink One platform. These examples demonstrate a few inorganic ways we are adding to our long history of organic innovation, which continues as well. Another innovation accelerator is our Partner Marketplace, and we continue to add important capabilities. For example, in Q1, we announced a first-of-its-kind partnership with Social Intelligence, a social media screening organization. This new collaboration provides our background screening CRAs the ability to offer social media screening to their customers seamlessly within the TazWorks platform. Our Partner Marketplace continues to expand, offering customers tailored choices to improve their customers' experiences through high-quality, easy-to-use API integrations with leading organizations. An additional highlights from the first quarter is a signed integration agreement between MeridianLink and Verafin, an industry-leading anti-money laundering solution. Next, I would like to discuss cross-sell. All of these new capabilities are a great segue to talk about our success in cross-selling our solutions as they add to the revenue opportunity of our data verification and MeridianLink One platforms. As a reminder, MeridianLink One is our platform of lending products, which spans a digital consumer lending journey from account opening through loan origination and data collection, decisioning and funding. For example, one existing customer, a bank with over $9 billion in assets, added MeridianLink Mortgage and MeridianLink Portal in Q1. They were considering other solutions but ultimately chose MeridianLink due to our enhanced integrations and automation functionality. Specifically, the bank was looking for a more competitive web-based solution with enhanced reporting, automation and visualization. They needed to simplify their processing workflow and eliminate manual tracking. In their words, they were looking for a completely digital experience for the customer and found their ideal technology partner in Meridianlink. Enabled by the seamless interface and data integration of MeridianLink One, our debt optimization functionality was awarded a patent in Q1. This combination of the capabilities of our lending and data verification software solutions enables our customers to offer differentiated lending options that monoline lenders, for those operating disconnected systems, simply cannot. In the quarter, we released the next phase of debt optimization to expand the types of loans that can be underwritten and offered through these unique capabilities. I'd also like to share an update about our successful in-person user forum. Last week, we hosted nearly 1,000 attendees from hundreds of customers and dozens of partners in Huntington Beach for our annual user forum, the first time we hosted the event live since 2019. The energy and excitement were palpable as we connected about how our solutions help customers deliver the personalized speedy experiences that today's consumers expect. The positive feedback and stories were inspiring and validating for our entire team. It was a great reminder of why we do what we do. It was also greater spent time in person with many of our employees, who are the reason for our continued success and excellence. My last update would be discussing bringing customers online more quickly. And I'd like to talk about how the increasing recognition of our market leadership with MeridianLink One and the associated strength in selling to both new and existing customers makes even more imperative investments we are making to bring customers online more quickly. While our hiring is somewhat behind schedule, the productivity of new and existing team members is in line with our expectations. In Q1, we were excited to add Liz Rieveley to our executive leadership team as MeridianLink's new chief people officer. With the benefit of Liz's expertise, we will accelerate our hiring and investment in additional people initiatives. We see the 30% year-over-year growth in services revenue in Q1 as indicative of the opportunity and expect to see sustained improvements in total time between contract signing and customer go live as the investments in our services team come to fruition. It's heartening to see the progress we are making and I'm confident in our accelerating momentum. Of course, none of this would be possible without the hard work of our dedicated team. Before I turn the call over to Chad, I'd like to discuss our continued success in migrating to the cloud. The work stream to complete the rearchitecture and deployment of the entire MeridianLink One platform in the cloud remains on schedule for the first quarter involving the prep work needed to migrate MeridianLink mortgage to the cloud during the second quarter. I am happy to confirm that we remain on track to remigrate the final components of our platforms to the cloud this year, at which point our MeridianLink One platform will be completely cloud native. I will now turn the call over to Chad to talk about our financial results and guidance. Chad Martin -- Chief Financial Officer Thanks, Nicolaas. And thanks again, to everyone for joining us today. I'll start by providing the highlights for the quarter, then I will recap the highlights of our financial model and provide our results in more detail, before finally giving guidance for the second quarter and full year 2022. As Nicolaas mentioned, in the first quarter, we generated total revenue of $72.8 million, up 7% year over year. 87% of our first quarter revenues were subscription fees, with the balance coming from professional services and other. Our GAAP operating income was $14.6 million, our non-GAAP operating income was $20.8 million, and adjusted EBITDA was $34 million. As a quick reminder, we have a usage-based SaaS recurring revenue model. Our customers sign long-term contracts, usually three years, that are not cancelable without penalty in which auto renew at the end of term. Typically, customers commit to annual fees and monthly purchases of applications or reports. In exchange for higher monthly commitments, they receive lower per unit pricing and any transaction over the monthly minimum commitment is an incremental charge. Our platform's ability to make our customers more efficient and effective naturally drives more volume once it is installed and used so we can grow with our customers and we are aligned with their success. We provide both lending software solutions and data verification software solutions. In the first quarter, lending software solutions revenue accounted for nearly 68% of our total revenue and grew 14% year over year. Excluding the impact from the anticipated slowdown in mortgage-related revenues, our lending software solutions revenues grew 19% year over year. The remainder of our revenues come from data verification software solutions, which decreased 4% year over year as mortgage-related revenues declined. First quarter revenues from the mortgage loan market generated 28% of our overall revenues, more than previously expected as we believe the surge in mortgage interest rates pulled forward some demand. Specifically, 7% of our lending software solution revenues and 70% of our data verification software solutions revenues were tied to our mortgage-focused products in the first quarter. While the majority of our data verification software solutions revenue is tied to mortgage, this part of our business outperformed the market as we continue to find ways to augment our solutions with additional data items and partners to provide more value to our customers, enabling them to continue to win share in the market. The seven points of year-over-year revenue growth in the quarter came primarily from our standard growth drivers, as we added new customers, saw increased module penetration and increased volumes from our existing customers. We expect to drive further growth as we bring additional capabilities to our customers through a combination of M&A, expansion of our partner marketplace and delivery of organically developed products. Moving to our profitability. Gross margin in Q1 was 66%. Adjusted for stock-based compensation, gross margin was 72%. We continue to invest in our sales and marketing and R&D efforts to drive organic growth acceleration. Compared to the first quarter last year, we spent 25% more in sales and marketing and 6% more in R&D, adjusted for stock-based compensation. With this additional spend, our adjusted EBITDA margin was 47%. We will continue to invest across the year to accelerate our underlying growth. Turning to the balance sheet and cash flow statement. We ended the first quarter with $146.7 million in unrestricted cash and cash equivalents, up $33.1 million from the end of the fourth quarter. Operating cash flow in the first quarter was $34.9 million, and free cash flow was $32.9 million or a 45% free cash flow margin. We continue to generate funds that can be used to invest in the business, pursue acquisitions, deleverage or repurchase shares under our recently authorized repurchase capacity of up to $75 million in common stock. I will now conclude the call by providing guidance for Q2 and an update for the full year of 2022. Despite the rapid rise in mortgage interest rates since the start of the year and the associated decrease in expected market volumes, we continue to see strong momentum overall, and our pipeline remains robust. For the second quarter, estimated total revenue is expected to be between $71.5 million and $73.5 million compared to $68.5 million for the same period in 2021. This represents an estimated increase of 4% to 7% year over year. In the second quarter of 2021, the mortgage market contributed $20.3 million of revenue to MeridianLink or just under a third of our revenue in the year ago quarter. We expect the mortgage market to contribute less than 25% of revenue for the second quarter of 2022. On a non-GAAP basis, our second quarter estimated adjusted EBITDA is expected to be between $25 million and $27 million, representing EBITDA margins of approximately 36% at the midpoint of the range. While our reported Q1 adjusted EBITDA came in well above our previous guidance, this was primarily due to underspending plans in the quarter, and we intend to accelerate spend in our outlined initiatives throughout the remainder of the year. This includes approximately $1 million per quarter to bring the recently acquired StreetShares solution fully to market as part of MeridianLink One. For the full year 2022, estimated total revenue is expected to be between $289 million and $293 million, compared to $267.7 million for the same period in 2021. This represents an estimated increase of 8% to 9% year over year. On a non-GAAP basis, our full year 2022 estimated adjusted EBITDA is expected to be between $112 million and $116 million, representing EBITDA margins of approximately 39% at the midpoint of the range. The lower year-over-year margin reflects anticipated increases in annual spending in areas that will drive future growth as described earlier by Nicolaas. We will continue to focus on the investment in services capacity to convert more bookings to revenue and the investment in development in the cloud to both enhance and expand our product suite, both items that require current expense that we expect will lead to future returns. As we forecast the balance of 2022, the normalization of activity in the mortgage lending market appears to be well underway. We expect this to continue being a minor headwind in lending software and a more meaningful drag on data verification software performance in the quarters ahead. Overall, the mortgage-related percentage of our revenue in 2022 is expected to decrease to the low 20s, down from 30% in 2021, subtracting more than five percentage points of growth from MeridianLink in 2022. While this reduction is more than we anticipated at the start of the year, as we have seen rates move higher faster than previously forecast, we have been building our business to counter the decline for some time. We have no doubt that we will continue adding new clients, providing more value to our customers and therefore, increasing revenue for MeridianLink as a whole, and our guidance for the year reflects the ongoing strength of the non-mortgage solutions we provide, which grew 17% year over year in our most recent quarter. With that, Nicolaas and I are happy to take any questions. Operator? Operator Sure, sir. [Operator instructions] Your first question comes from the line of Koji Ikeda with Bank of America. Please go ahead, please. Lory Luo -- Bank of America Merrill Lynch -- Analyst Hi. This is Lory Luo on for Koji. So thanks for taking my question. So I got a couple. The first one is on the StreetShares acquisition. What's the contribution there for the full year, given that the weak refi market, but you guys still guided up for the full year? And then second, how do you think about like what's the growth driver on the consumer side on auto demand and also what are the other growth drivers there? Thank you. Chad Martin -- Chief Financial Officer Sure. This is Chad Martin speaking. On the StreetShares, so we do have that built into the full year. It will be basically -- it's not a material acquisition for us from a revenue perspective. It's basically around one point of revenue growth year over year, less than $1 million a quarter for the balance of the year. And then the growth drivers on the consumer side, right, we continue to see, as we've talked about in the past, the same kind of growth drivers pushing the nonmortgage consumer lending space. So the growth in new customers, the growth in our customers' volumes, as well as cross-sell and upsell into those entities. And if you look at the growth in the lending side for the first quarter, was up 14%. And if you adjust that for mortgage, it was up around 19%. So continuing to expecting to see consumer growth in the teens. Lory Luo -- Bank of America Merrill Lynch -- Analyst Good. Great. That's helpful. And just to follow up, do you have -- can you share any color on our consumer side, how's the auto mix there? It's considered as like majority of the consumer loan. Is that still going to be the case going forward? Chad Martin -- Chief Financial Officer Yes. So we have not seen any real material change in our mix on the non-mortgage side of the business. Auto is the largest component of the consumer piece. And that's been doing pretty well. I think you've seen some of the data around used cars, prices coming down and some constraints around supply easing up. So we continue to see that to be a material contributor to the volumes and no real change as we expected going forward for the year. Lory Luo -- Bank of America Merrill Lynch -- Analyst Great. Just one last one for me is, do you have any data on the mix of new auto versus the used car percentage? Chad Martin -- Chief Financial Officer We don't. We don't split out kind of the overall loans by the auto type, and we certainly don't split it into new and used. And I don't think we, frankly, actually, on the back end, necessarily see that because an auto loan is an auto loan from how our system would process it. Lory Luo -- Bank of America Merrill Lynch -- Analyst Gotcha. Okay. Thanks. Thanks very much. Chad Martin -- Chief Financial Officer Yep. Thank you. Operator Thank you. Your next question comes from the line of Andrew Schmidt with Citi. Please go ahead. Andrew Schmidt -- Citi -- Analyst Hey, guys. Thanks for taking my question. Just to start off on the -- just the annual revenue outlook. Obviously, you take out StreetShares and the outperformance in the first quarter, a little bit of a guide down for the rest of the year. Is that -- I just want to put a finer point on that. Is that mostly mortgage outperformance in the first quarter, what you feel is a pull forward and more of a softening given the rate environment we're seeing for the rest of the year? Or are there other factors? I know hiring has been a little bit slower. So wondering if there's any impact on the implementation side or if this is purely sort of more rates driven for mortgages. Just looking to get a little more color there. Thanks a lot. Chad Martin -- Chief Financial Officer Yeah, Andrew. Good question. Good question. It is mostly driven by mortgage. We did see our percent of revenue from mortgage come in slightly higher in Q1 than we'd initially guided. We think we saw a bit of a last gasp as rates started rising and some of the mortgage volume push through in Q1. So we think we did pull a little bit of revenue into the first quarter from -- for the year. And then, yes, we're guiding now for the balance of the year to be down from kind of the mid-20s to the low 28% of mortgage for the year. So a couple of points of drag there on 2022 in the back half of the year. But again, also seeing the strength on the consumer side, helping to kind of make up that gap. Andrew Schmidt -- Citi -- Analyst That's helpful. So it sounds like you're working through the backlog as expected on the consumer... Chad Martin -- Chief Financial Officer Yes. Sorry. Your question around hiring and bringing folks on. Yes. So we've actually -- a lot of our emphasis has been on filling those positions in the services team. So we're not quite exactly where we want to be, but we are bringing folks on. We're seeing their productivity as Nicolaas discussed in his remarks, and so they are having the impact that we're expecting. But nothing that is kind of either swinging the number higher or lower from what we'd initially put forward for '22. Andrew Schmidt -- Citi -- Analyst Very helpful. And then it seems like overall, the consumer remains relatively healthy, but obviously, there are concerns about more economic turbulence as the year progresses. There are puts and takes, obviously, some types of demand for some types of loans go down but could be offset by demand for other types of loans. Could you just remind us sort of the sensitivity of the business to economic turbulence, how you think about that just various puts and takes at a high level? That would be helpful. Thanks. Chad Martin -- Chief Financial Officer Yeah, Andrew. So as we think about the sensitivity, right, I mean, the best kind of view we have of the sensitivity of the consumer market is just looking kind of retrospectively. And if you look at kind of the last 20-plus years, absent one year in the Great Recession, that consumer loan behaviors, consumer lending has grown every year. So it is a pretty -- it is not very sensitive, I would say, to kind of the macro movements for the economic shifts. And so we're using and leveraging what we see from the folks who kind of call the market for consumer. CUNA has 2022 growing 8% year over year, up from 6% last year. I think that's a slight decline from the 9% they called at the beginning of the year, but our volumes still reflects that we see kind of growth in this space in line with that. And so we're not expecting -- we don't know what we don't know in terms of other kind of macroeconomic shifts that may occur. But given kind of the current environment, we're comfortable with what we have put in for the forecast for the balance of the year. Andrew Schmidt -- Citi -- Analyst Very helpful. I'll jump back in the queue. Thanks a lot. I appreciate the comments. Chad Martin -- Chief Financial Officer Thanks, Andrew. Operator Thank you. Your next question comes from the line of Saket Kalia with Barclays. Please go ahead. Saket Kalia -- Barclays -- Analyst OK. Great. Hey, guys. Thanks for taking my questions here. Nicolaas, maybe I'll start with you. A little bit of a similar question, but just a little bit more specific. As you think about new customers in the lending solutions business, what have you typically seen in terms of new deals, new customer wins during rising rate environments? And what I mean by that is, is the rising rate environment sometimes a catalyst for a bank or a credit union to invest while interest income is better? Or do they maybe handle their investments differently in rising rates/kind of more uncertain environment? Nicolaas Vlok -- Chief Executive Officer Thanks, Saket. And a great question. And if I may respond, I may actually weave in some comments to the two previous folks who asked questions as well. But our take is on the consumer lending side, the overall trends remains largely unchanged. And Chad highlighted the CUNA data that is as recent as April. And we continue to see FIs making continued investments in digital transformation. In fact, I would say coming off from our user forum last week, where it was nearly 1,000 folks interacting with us at a high pace for four days, I walked away with some very strong views on a lot of our customers are embarking on a journey, and this is a multiyear journey, and they are rethinking their business to be on the digital transformation bus, so to speak. And some have made some real steps forward. Others are kind of getting into it. And I believe that with rising rates, it creates an opportunity for our core LOS customers, which are the positively taking institutions, to differentiate themselves here in the lending market. I think it's a playbook that plays into our platform and what we've been investing in for the last three, four years. And I would add that many of our customers are sitting on a large base of deposits that came in during times of COVID stimulus. And higher rates are a catalyst for them to put that money to work by extending credit. And in this type of environment, I feel it's a good opportunity for us to also position our new Engage product, which is more focused on enabling our customers to be very targeted in their marketing, trying to focus on increasing their lending portfolio the way they choose to go do it. And on top of that, we've also seen strong interest and a push by our customer base into HELOCs. And I expect that to be kind of a loan channel on the consumer side, where those folks that will grow, where those folks want to take advantage of equity in people's homes and offset some of the refi drop some of them have experienced. And another loan channel that I continue to hear more interest from is personal loans, and I expect that to be also a strong area of interest now that stimulus has started relaxing. And my take is rising interest rates based on a larger than usual deposit base, is a market that MeridianLink can play very well in. Saket Kalia -- Barclays -- Analyst Got it. That's very helpful. Maybe for my follow-up, I'll just keep it to two here. Chad, for you, obviously, that conversion for the strong bookings in '21 to revenue in '22 and going forward is going to be contingent on sort of that hiring in the services organization. Can you just give us sort of a sense for where you are? And just as importantly, what is that gross margin or cost of sales line don't look here through '22 as again, you invest ahead of that revenue? Does that make sense? Chad Martin -- Chief Financial Officer Yes. Yes. That makes sense. So we are hiring. We were a little bit better on margin in Q1. I think we were a little bit behind our overall company hiring as well as just kind of had some deferred initiatives that kind of pushed into the back of the year. But we did -- the full year, our margin guidance is in a similar place where we're going to see some impact on 2022 gross margins, mostly around adding the services resources. But we think that, that investment is prudent because that will bring on the revenue, as you referenced, that will kind of take margins back up through time, because we think we're going to kind of rightsize the services group and then not need to kind of continue to add and augment going forward, and we'll have the capacity to kind of convert the good growth we're seeing in bookings into revenue at the appropriate pace. So will be a bit of a drag on '22 gross margins, but we're still comfortable with our long-term margin guidance as we kind of see that being a onetime investment that pays off this year and next. Saket Kalia -- Barclays -- Analyst Got it. Very helpful. Thank you. Operator Thank you. Your next question comes from the line of Nik Cremo with Credit Suisse. Please go ahead. Nik Cremo -- Credit Suisse -- Analyst Hey. Thanks very much for taking my question. First, I wanted to ask about the contract minimums that Chad was discussing in the prepared remarks and if you guys could give us any kind of high-level color as to what the contract minimums represent in the 2022 guide? Chad Martin -- Chief Financial Officer Sure, Nik. So we do have contract minimums. Most of our customers still set their minimum at a rate at which they usually exceed during the months of the year. They typically pick a number that is tied to their low point in volume on a seasonal basis. And so in our guidance for the year, I would -- and many customers are substantially above their historical minimum or their contract minimum, especially those customers who have been on historical contracts that were set, they set their minimums a while ago. So as it relates to our '22 guidance, the minimums aren't really something that we forecast or talk about in how we set our budget. We expect most customers to exceed that. And therefore, we focus more on what we think volume -- our number of customers will be and the volume from our customers. But every year that we kind of bring more customers on or customers reset their minimums that, that minimum level of revenue is increasing but it's still not the preponderance of our overall revenue streams. Nik Cremo -- Credit Suisse -- Analyst OK. Got it. Understood. And then as my follow-up, I just wanted to get a sense for what kind of cost savings we could see from MeridianLink One being completely in the cloud by the end of the year? Is that something that we would see in gross margins in 2023? Chad Martin -- Chief Financial Officer So from the margin perspective, candidly, '22 will be an increased cost as we move all the customers into the cloud but still have the costs of our data centers that we're carrying until we kind of get the full movement in motion into the cloud so we can begin to wind those data center costs down. But we do expect in '23 that there will be benefit to the overall margin. One, once we get our customers all in the cloud and have a better understanding for how we can kind of optimize our cloud spend with our cloud partners. And then two, the reduction in our data center costs. That will create some reduction in spend in '23. But candidly, '22, where we're both carrying the data center and the migration, we won't see much savings in this year. Nik Cremo -- Credit Suisse -- Analyst Got it. Thanks very much. Operator Thank you. Your next question comes from the line of Matt VanVliet with BTIG. Good afternoon. Matt VanVliet -- BTIG -- Analyst Please go ahead. Yeah.Hey. Thanks for taking my question. I wanted to maybe dig in a little bit in terms of what you've seen so far year to date as rates have been going up if there's much -- whether it's mix shift or just overall demand across or any differences between credit unions and maybe smaller regional or smaller community banks and then maybe some of your larger banks out there? Just if you're seeing any kind of difference of activity within those different groups of institutions? Nicolaas Vlok -- Chief Executive Officer Yes. I would highlight what I've said a little earlier, more interest in HELOCs than in the past, also personal loans. But then the bigger story is as folks are engaging and very committed to digital transformation for their businesses. And from our standpoint, we continue to see high levels of activity and high levels of engagement. And my experience at our user forum was very buoyant, that exceeded my expectations in client engagement and the questions and what folks are planning on for the next year, two years, three years, the number of hand raisers and attendees and breakout sessions. I would tell you it is busy, people are looking at how to accelerate their business. And my sense right now is that the CUNA data that we've referenced a little earlier is not far off. Something big would need to change, in my opinion, to impact the trajectory of, call it, Main Street Americas financial institutions. Matt VanVliet -- BTIG -- Analyst All right. That's very helpful. And then any update you want to share in terms of the uptake on MeridianLink One? And then some of the other kind of add-on modules whether it's some of the more kind of direct targeting, direct marketing type of modules you have out there and sort of what the uptake has been on those as a number of your clients are looking to drive that interest income as much as possible? Thanks. Nicolaas Vlok -- Chief Executive Officer Continue to see great traction, great momentum with our ability to deliver a platform for our clients. Very excited to be in the cloud by the end of the year, which is going to continue to enable us to scale and do more with the platform from an overall integration analytics automation standpoint. And MeridianLink is doing really well, keeping pace with that commitment. In addition, we also have had a very successful beta program and then a launch of Engage with really strong top of funnel metrics, specifically to your question on that and expect to start seeing more of that convert in the second half of the year into bookings from clients who is leaning into the solution, leaning into automation, leaning into more data-driven personalized lending playbooks. So very pleased with the, call it, momentum to date with what we've seen. Matt VanVliet -- BTIG -- Analyst All right. Great. Thank you. Operator Thank you. Your next question comes from the line of Cris Kennedy with William Blair. Please go ahead. Cris Kennedy -- William Blair -- Analyst Good afternoon. Thanks for taking my questions. I apologize if I missed it, but did you talk about how bookings were in the first quarter? I think they were at record levels in the fourth quarter. Nicolaas Vlok -- Chief Executive Officer Again, we've seen a good quarter overall. I don't think we've announced a number of new client wins, but it was up in a decent new client one quarter for us. The business has continued to work and move forward. I can tell you we're excited about product launches. We're excited about where we're at, bringing in some new sales folks, bringing them online. So really well positioned for the year, driving growth. Cris Kennedy -- William Blair -- Analyst OK. Great. And then just a follow-up on the sales force investments, can you kind of talk about where we are in that journey and how the productivity of your investments are progressing? Nicolaas Vlok -- Chief Executive Officer Yes. We'll continue to invest in the tech stack. And from a MeridianLink standpoint, we believe in automation and also efficiency gains through the tech stack as we drive scaling in the business. The investments are going well. We're pretty pleased with the systems we have and that we've been working on over the last few years. It should position the company well to layer in additional acquisitions that will position us well to continue to add go-to-market resources in the business. Feeling good about the path and trajectory forward with it. Cris Kennedy -- William Blair -- Analyst Thank you. Operator Thank you. Your next question comes from the line of Alex Sklar with Raymond James. Please go ahead. Alex Sklar -- Raymond James -- Analyst Thanks, Nicolaas. I wanted to ask specifically about the cross-sell of your mortgage LOS to consumer LOS customers. Now with the better integration between those two solutions, I know you named one win in the prepared remarks, but can you just talk about that cross-sell motion in particular? And what percentage of your consumer LOS customers take the mortgage lending product? Nicolaas Vlok -- Chief Executive Officer That's a good question. From a cross-sell standpoint, it's a great opportunity ahead of us. We see depository taking institutions as a playbook that we're going to continue to expand on. Historically, that was not the focus. It kind of became more of a focus over the last 12, 18 months with our platform playbook coming to reality. It is, I would say, still single-digit customer penetration and something that our team is focused on in driving and feel it's from a cross-sell standpoint, especially with the focus on where the market is heading, an opportunity that will play out in our favor over the course of the next few years. Alex Sklar -- Raymond James -- Analyst OK. Great. And then on the sales hiring efforts, kind of referring back to an earlier question, but can you just walk us through where you stand in terms of overall headcount now in there? And what kind of the target is for the end of the year if that change fill? Nicolaas Vlok -- Chief Executive Officer Yes. From a headcount hiring standpoint, we continue to drive hiring. And I would say, found some great people in the course of the quarter, especially in a fairly challenging or a very challenging hiring marketplace to date. Excited about the talent that have joined us. We would love to see more of the same quality of talent join the company and integrate into our sales leadership and our sales and go-to-market motions. We certainly build out capacity on the marketing side as well to lead on the forefront with campaigns and initiatives for our sales team. So mostly keeping pace in our go-to-market organization would have loved to maybe have a handful of hires knockdown in Q1. But overall, no major concerns from the sales and marketing hiring we've done in Q1 leading into Q2. Alex Sklar -- Raymond James -- Analyst All right. Great. Thank you. Operator Thank you. Your next question comes from the line of Parker Lane with Stifel. Please go ahead. Max Osnowitz -- Stifel Financial Corp. -- Analyst Hey, guys. It's Max Osnowitz on for Parker Lane. I want to start just by circling back on Engage and the early success that you guys have seen. Is it really attracting a new set of customers that aren't using other MeridianLink products? Or is it kind of bridge the gap and completed the package, so to speak, on MeridianLink's offerings? Nicolaas Vlok -- Chief Executive Officer It does both. But our initial focus and focus for 2022 is more on driving cross-sell and upsell. And again, referencing our user forum from last week, that was a very big cross-sell, upsell playbook for us and our account management team and Engage was on the forefront of the discussions. My take right now is, we can be more than successful and continue to drive significant cross-sell, upsell opportunities this year, next year being heavily focused on the existing customer base. But that is not the playbook after, call it, initial launch traction. It will expand and we will drive also new logo sales with it. Max Osnowitz -- Stifel Financial Corp. -- Analyst Got it. And then just thinking about the StreetShares acquisition, is that going to complement the template-based offering you've created for the smaller business lenders? And how should we think about the size of that kind of customer group and its contribution to overall revenue going forward as you add more solutions? Nicolaas Vlok -- Chief Executive Officer Yes. We've had our own small business lending module for our platform, which has found good traction. The StreetShares solution is just a broader, deeper offering, and we really like what they've done with automation and decisioning, and the relationships that they've built with industry partners. Think of small business lending as loans to small businesses of $1 million or less and that's kind of a very rough circle of growing. And we've looked at the market, we know what's available. We know who we're competing against. And StreetShares, from a product standpoint, is a fantastic product. It's a cloud-native product and it integrates well into our own strategy as well as our platform. So excited to expand the small business offering that MeridianLink had with the strength and the breadth and depth of the StreetShares solution. Max Osnowitz -- Stifel Financial Corp. -- Analyst Got it. Thanks. Operator [Operator instructions] Your next question comes from the line of Andrew Schmidt with Citi. Please go ahead. Andrew Schmidt -- Citi -- Analyst Hey, guys. Thanks for taking my follow up. I just wanted to ask a higher-level portfolio question. Kind of actually tabbing onto that -- the previous question. StreetShares gives you more sophisticated capabilities and small business lending. Does it also create sort of more of a road map for just adding more capabilities in general business or commercial? Just curious how you think about the opportunity in business and commercial relative to the core consumer business. Nicolaas Vlok -- Chief Executive Officer Yes. Great question, Andrew. Our focus is very much on consumer and the type of small business lending that we focused on is the consumer, who is a small business owner and typically the credit profile of the small business owner backs up the decision that's tied into lending to the small business on our Main Street. The differentiation between what we do and call it more full-blown commercial lending is it's a very different decision cycle, it's a very different playbook on the commercial lending side, which tends to be focused on a lot more analysis from the financial standpoint balance sheet, cash flow, which is typically not the small business lending our clients are engaging in as it relates to a specific consumer. And our focus is providing more value in, call it, that $1 million and below market with a consumer kind of being the credit profile that get decision. Andrew Schmidt -- Citi -- Analyst Understood. Thanks, Nicolaas. Appreciate the comments. Operator And I'm showing no further questions at this time. I will now turn the call back over to our CEO, Nicolaas Vlok, for closing remarks. Nicolaas Vlok -- Chief Executive Officer Thank you, operator. And I again want to thank our employees for all that they do, which was recently recognized externally by two different organizations. Our MeridianLink Mortgage product won the prestigious HousingWire 2022 Tech100 Mortgage Award. Our mortgage loan origination and account opening software was selected as a winner based on its innovative approach to improving borrower experience and also bringing flexibility to the mortgage origination and servicing processes. And in addition to that, we were also recently recognized by the American Business Awards, and some may know better as Stevie's for our achievement and growth on our path and leading up the successful IPO in 2021. And that's all. Thanks to our employees. And with that, I will sign off and hand it over to the operator. And thank you so much for your time today, and we appreciate you joining us as we review yet another successful quarter behind MeridianLink. Have a great day. Operator [Operator signoff] Duration: 52 minutes Erik Schneider -- Head of Investor Relations Nicolaas Vlok -- Chief Executive Officer Chad Martin -- Chief Financial Officer Lory Luo -- Bank of America Merrill Lynch -- Analyst Andrew Schmidt -- Citi -- Analyst Saket Kalia -- Barclays -- Analyst Nik Cremo -- Credit Suisse -- Analyst Matt VanVliet -- BTIG -- Analyst Cris Kennedy -- William Blair -- Analyst Alex Sklar -- Raymond James -- Analyst Max Osnowitz -- Stifel Financial Corp. -- Analyst More MLNK analysis All earnings call transcripts This article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy. STOCKS MENTIONED *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. RELATED ARTICLES Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. ABOUT THE MOTLEY FOOL OUR SERVICES AROUND THE GLOBE FREE TOOLS AFFILIATES & FRIENDS"
    }
]