[
    {
        "Date": "2025-02-18",
        "Company": "MeridianLink Inc.",
        "Ticker": "MLNK",
        "Source Name": "seekingalpha.com",
        "Source URL": "https://seekingalpha.com/article/4735631-meridianlink-inc-mlnk-q3-2024-earnings-call-transcript",
        "Extracted Text": "MeridianLink, Inc. (NYSE:MLNK) Q3 2024 Earnings Conference Call November 7, 2024 5:00 PM ET Company Participants Gianna Rotellini - Senior Director-Investor Relations & Strategic Initiatives Nicolaas Vlok - Chief Executive Officer Larry Katz - President Elias Olmeta - Chief Financial Officer Conference Call Participants Cris Kennedy - William Blair Jessica Wang - Raymond James Operator Ladies and gentlemen, thank you for standing by and welcome to MeridianLink's Third Quarter 2024 Earnings Call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will a question-and-answer session. Please be advised that today's conference is being recorded. I would now like to turn the conference over to your first speaker today, Gianna Rotellini. Gianna, please go ahead. Gianna Rotellini Good afternoon and welcome to MeridianLink's Third Quarter Fiscal Year 2024 Earnings Call. We will be discussing the results announced in our press release issued after the market closed today. With me today are MeridianLink's Chief Executive Officer, Nicolaas Vlok; President, Larry Katz; and Chief Financial Officer, Elias Olmeta. Before we begin, I'd like to remind you that today's conference call will include forward-looking statements based on the company's current expectations. These forward-looking statements are subject to a number of significant risks and uncertainties and our actual results may differ materially. For a discussion of the risks, uncertainties and other factors that could affect our future financial results and business, please refer to the disclosure in today's earnings release and the periodic reports and filings we file from time to time with the Securities and Exchange Commission. All of our statements are made based on information available to us as of today and except as required by law, we assume no obligation to update any such statements. Please note that, other than revenue, all numbers in our remarks are on a non-GAAP basis, unless otherwise stated. A reconciliation to comparable GAAP metrics can be found in today's earnings presentation, which is available on our Investor Relations website and as an exhibit to the Form 8-K furnished with the SEC just before this call. Our earnings presentation is available for you to download and reference throughout our prepared remarks. With that, let me turn the call over to Nicolaas. Nicolaas Vlok Thank you, Gianna. Good afternoon everyone. Our team executed well in the third quarter. We achieved revenue of $80.4 million or 5% growth year-over-year, in line with the high end of our guidance. Adjusted EBITDA was $33.8 million, representing a 42% EBITDA margin, exceeding the high end of our guidance. I am pleased that we returned $31.3 million of capital to shareholders via stock buybacks at attractive valuations. Our solid Q3 results were driven by the company's continued disciplined execution. Revenue growth accelerated in the quarter on the back of continued annual contract value or ACV release. Margins exceeded expectations as we proactively manage spend in an uncertain macro environment. Last quarter, we discussed the headwinds that our community bank and credit union customers face in this uncertain macro environment. This quarter, we saw a modest rebound in activity due to lower rates, but our view of recovery remains unchanged, as we expect that headwinds will persist and the market will take time to normalize. First, community banks and credit unions continue to be deposit constrained as loan-to-deposit ratios remain at elevated levels. We expect that deposit growth will return to pre-pandemic levels, but it will take time for depositories to migrate deposits back from higher-yielding alternatives. Second, affordability of used cars, continue to be out of reach for many due to high prices and elevated financing rates. We expect lower used car prices as new cars work their way to used car lots, but it will likely take time to see meaningful impact on affordability. We also expect that affordability will improve with lower financing rates. But to date, financing rates remain persistently high, particularly in the used auto market. Third, although we are seeing an increase in mortgage originations, we are not expecting a robust originations market in the short or medium term. Mortgage rates have moved higher in recent weeks, which continues to moderate demand and reflects macro uncertainty. Most outstanding mortgages are priced well below current mortgage rates and we expect it will take multiple rate cuts to stimulate a significant increase in activity. Moving to highlights in the quarter. I want to start with one of our strategic focus areas, developing our people and leadership team to scale our business. In Q3, we strengthened our management team with the promotion of Larry to President and the onboarding of Elias to CFO. These proven SaaS leaders have deep industry knowledge and have operated successfully at scale. We are already seeing the impact of their leadership in the business. We continue to have great success with our land-and-expand strategy, as we deepen relationships with customers and generate solid demand from those continuing their digital transformation. Financial institutions are expressing more confidence in the midterm economic outlook and we are seeing increased buying signals from customers, using both mortgage and consumer lending solutions to strategically retool for a market recovery and the evolving digital lending needs of consumers. Our innovative platform continues to be a differentiator in the market. I love getting feedback from customers that use MeridianLink One to serve clients, accelerate growth and achieve operational efficiencies. We continue to invest in innovation that delivers differentiated outcomes for our customers. With that, I will turn it over to Larry to review our business highlights in more detail. Larry? Larry Katz Thanks, Nicolaas. We had a solid third quarter with a mix of new logos, cross-sell and upsells. Bookings momentum continued as customers turn to MeridianLink as a trusted partner to accelerate their digital transformation. I've been on the road over the past 60 days with customers, prospects and partners, and I continue to see firsthand the unique value proposition of our platform for mid-market financial institutions. No other solution offers the breadth or depth of MeridianLink One's end-to-end modern digital lending capabilities, including its ability to automate processes, enable data-driven decision-making, improve close rates and improve risk management. Chief Lending Officers and digital transformation officers embrace our platform because it enables them to compete in an increasingly digital world with a solution set that accelerates speed, expands reach and generates demand. Our existing customer base continues to be one of MeridianLink's most strategic assets. As a leading vertical SaaS company with a successful land-and-expand strategy, our bookings are mostly driven by expansion opportunities within our existing customer base. I'd like to highlight that mortgage cross-sell momentum remains strong as we continue to take market share with our integrated mortgage lending platform. Once again, this quarter, we signed multiple high-value cross-sell deals across consumer and mortgage. This includes both consumer customers adding mortgage and mortgage customers adding consumer, highlighting the bidirectional cross-sell momentum enabled through our MeridianLink One platform. As an example, an existing MeridianLink One credit union customer with more than $750 million in assets added MeridianLink Mortgage Access and our patented debt optimization solution to their existing consumer solution. This customer consolidated five disparate mortgage systems into our single platform that they had already deployed for personal, credit card, vehicle and account opening capabilities. This expanded footprint further enables this customer to develop a holistic view of their members' wallet and helps them best serve their members' borrowing needs through personalized offers. As another example, we announced that Broadway Bank, one of the largest privately owned banks in Texas with more than $5.5 billion in assets, recently expanded its use of MeridianLink One with its go-live on MeridianLink mortgage. This customer's implementation enabled centralization of loan operations under one system and reduced its loan processing time by up to six days. With time saved and greater visibility across the entire consumer debt wallet, Broadway Bank staff are delivering more personalized customer experiences and building stronger customer loyalty. Turning to new logos. The power of MeridianLink One continues to resonate with Chief Lending Officers and digital transformation officers due to its integrated platform offering, configurability and breadth of marketplace partners. This quarter, we won a $370 million AUM new logo credit union that is embracing its digital transformation by selecting MeridianLink One for its digital lending capabilities, including account opening, personal lending, credit card, direct auto lending and indirect lending. This customer replaced its existing providers due to our ability to drive speed of decisioning, create a cohesive digital customer experience and provide an integrated view of the consumer. I want to now turn to share some observations from my time in the market over the past couple of months. As I mentioned earlier, I prioritized meeting with customers, prospects and partners. Through these discussions, I've gained a stronger appreciation for our unique value proposition and the depth of our customer relationships. MeridianLink's integrated platform is viewed by customers as highly differentiated from point solutions and central to the design of their business processes. Our high-performing dedicated sales, services and success teams are partners to our customers and relied upon to help them advance on their digital journey. We feel confident that we have a strong foundation to scale upon. I've also gained an appreciation for our opportunity to consistently deliver exceptional customer experiences. Over the past two years, we've invested in our go-to-market services and customer success teams, which has further positioned us to scale. Now for the first time, we've internally aligned all customer-facing functions, marketing, demand generation, sales, implementation services, consulting and customer success under common leadership to drive speed, consistency and scalability. This focus and alignment is really important at this stage of our journey and will set us up for the next stage of growth with both new customers and existing customers. Having one team that embraces the customer journey end-to-end enables us to further deliver on the promise of our platform. I would like to end by reiterating my excitement to help lead the next leg of MeridianLink's journey. I'm honored to partner with Nicolaas and our colleagues to lead this exceptional team. With that I'll turn the call over to Elias to take us through the financial performance and guidance. I'm excited to work again with Elias after all these years. I have no doubt about the value that he will bring to our team. Elias is a proven CFO, having served as CFO of Mitchell International, a provider of SaaS solutions to the automotive and insurance industry and most recently at Vistage, a subscription-based professional services business. Elias currently serves on the Board of AutoCanada, Canada's largest automotive dealer group and a public company. I'm confident that you will find continuity in our philosophies to the CFO role and approaches to value creation. Elias? Elias Olmeta Thanks, Larry. It's great to be here on my first earnings call and good afternoon everyone. I'm excited to have joined MeridianLink to partner with Nicolaas, Larry and the team to help lead the company through its next phase of growth and expansion. As Larry mentioned, I've worked with a number of SaaS companies over the course of my career, helping them scale their operations and create long-term value. I've also helped organizations unlock growth potential through more effective financial operations and greater focus on metrics. I'm excited to bring my experience to MeridianLink and to work alongside this outstanding leadership team. With the company's solid foundation, I see tremendous opportunities ahead. First, MeridianLink is a remarkable company with a unique value proposition as the leading lending platform of choice for credit unions and community banks. I know the power, value and stickiness of vertical enterprise platforms from my time at Solera and Mitchell. Platforms like MeridianLink are the heart of our customers' enterprise, helping them achieve their goals and powering their businesses. We are the leading platform in a growing resilient market segment, where MeridianLink's digital capabilities enable our customers to compete and grow. Second, the fundamentals of this business are strong. We have solid margins and robust cash generation capabilities. We also benefit from a secular trend towards digitalization in particular by mid-market banks and credit unions looking to cater to their clients' lending needs. This is a durable business with recurring revenue insulated by contractual minimums with upsides as those minimums are achieved. It is led by a management team that has executed with discipline through market cycles. Third, I believe we are well positioned to accelerate growth. With the power of MeridianLink One, we have significant expansion prospects with our current customer base and partner relationships as well as new logo opportunities. With our solid pipeline, bookings and activations, we believe that over time there is substantial upside as volumes gradually recover driving accelerated revenue growth. As CFO of MeridianLink, I plan to focus on three key areas and continue the work that Larry started. One, I will deliver against our operating priorities, bringing continued rigor, discipline, data and analytics to measure progress and inform decisions. And I'll hone our short- and medium-term investment priorities to articulate a long-term growth plan including milestones over a three-plus-year period. Two, in line with our prior framework, I will take a disciplined capital allocation approach. To reiterate our order of priorities is first, investing in organic growth in areas such as product, go-to-market and services, especially when these investments deliver repeatability and scale to the organization with a high ROI; second, disciplined accretive M&A that provides us with a high ROI both strategically and financially. We have a strong track record of undertaking and integrating M&A successfully and we remain ready to execute on the right opportunities and we continue to actively explore them; and third, repurchasing our shares when those trade at a discount to intrinsic value and when we believe the returns on those shares are attractive. We expect that we will be able to do all three with our recurring revenue, free cash flow generation and balance sheet capacity. Finally, I will seek to help our investors better understand the performance of our business and the levers of our growth including our revenue algorithm. As I settle into the seat, we will work on delivering information with greater transparency, helping investors better understand our performance and setting appropriate expectations. Now moving to our results. MeridianLink demonstrated solid performance in the face of continued though slightly diminished macro headwinds in Q3. We generated GAAP revenue of $80.4 million or 5% growth year-over-year, in line with the high end of our guidance range led by lending solutions revenue growth of 7%. Adjusted EBITDA was $33.8 million, representing a 42% EBITDA margin and exceeding the high end of our guidance range. We generated $18.7 million of free cash flow and ended Q3 with $82.3 million in cash and cash equivalents. Total debt was $473.9 million. And excluding debt issuance costs and cash, net debt was $387.6 million, representing net debt to LTM adjusted EBITDA of approximately three times. Now turning back to our revenue performance and starting with revenue by source. Total GAAP revenue grew 5% year-over-year, driven by 4% growth in subscription revenue, 17% growth in services revenue and a 9% decline in other revenue. Subscription revenue, which accounts for 84% of total revenue, grew from the levers that are in our control, primarily ACV release. Further breaking down our 5% revenue growth, price and churn were in the low-single-digits each and mostly offset each other. ACV release contributed high-single-digits and volumes and one-time customer downsells combined were a low-single-digit drag. Now, looking at total revenue by solution type. Total lending software revenue growth was 7% year-over-year and accounted for nearly 78% of revenue. Non-mortgage lending revenue growth was 9% year-over-year and accounted for 90% of lending software revenue. This growth rate was largely attributable to ACV release from existing and new customers, which highlights the continued solid performance from our professional services team. Mortgage-related revenue within lending software solutions declined 7% year-over-year and accounted for the remaining 10% of lending software revenue. The decline was attributable to customer churn. Mortgage volumes in the quarter were strong year-over-year but the majority of our contracts, are at or below their committed minimums and it will take time for volumes to push more customers above their committed minimums to drive revenue. Turning to data verification software solutions. Revenue declined 1% year-over-year and accounted for 22% of total revenue. This decline was attributable to a 2% decrease in mortgage-related revenue, which represented 56% of total data verification software revenue in Q3. This decline in mortgage-related data verification revenue was driven by the one-time downsell of a single large customer, which is now operating at their minimum for the remainder of the year. Moving on to our profitability. Adjusted gross profit was $58.9 million, representing a 73% margin. This represents a 145 basis point of improvement in operating leverage year-over-year driven by continued productivity of our services team. Turning to operating expenses. R&D expense was $7.3 million or 9% of revenue and declined 23% year-over-year, reflecting continued cost discipline, including lower staffing due to our previously announced restructuring. Sales and marketing expense was $8.6 million or 11% of revenue, up 5% year-over-year. This increase is due to investment in go-to-market. G&A expense increased 18% year-over-year to $10.4 million or 13% of revenue, reflecting select discretionary investments made to position the company for scale in 2025 and beyond. Adjusted EBITDA was $33.8 million, representing a 42% margin. This represents over 300 basis points of improvement in operating leverage year-over-year. We made some purposeful discretionary investments in Q3 while maintaining disciplined cost management in an uncertain macro environment. We do not expect margins to remain at these elevated levels and we expect them to normalize in 2025 and beyond as we undertake further discretionary investments to accelerate future growth. Finishing with our capital position. We ended the third quarter with cash and cash equivalents of $82.3 million, a decrease of $10.7 million from Q2 driven by share buybacks. Total debt was $473.9 million. And excluding debt issuance costs and cash, net debt was $387.6 million. Cash flow from operations was $20.6 million or 26% of revenue and free cash flow was $18.7 million or 23% of revenue. The company executed several significant capital market activities in the quarter. On September 30, we completed another secondary public offering of 6 million shares of common stock by funds managed by Thoma Bravo, providing greater liquidity for the stock and attracting new investors. We also returned $31.3 million of capital to stockholders via stock repurchases in Q3 and have returned a total of $105.6 million on a year-to-date basis. These share buybacks are consistent with our capital allocation framework, I discussed previously. Now, I'll turn to guidance for Q4 and update guidance for the full year 2024. We are encouraged by our year-to-date performance in Q3 in particular, which was driven by ACV release and disciplined execution. While Q3 was solid, we are holding our guide for the full year at the midpoint of our revenue range and tempering our Q4 expectations primarily because of the recent increases in mortgage and treasury interest rates. In addition, liquidity of financial institution remains constrained and auto affordability remains low. As the macro environment improves, we believe the headwinds impacting our customer base will moderate over the medium-term. But this is likely to take quarters and will happen at different speeds. Nonetheless, we are focused on the things within our control, investing for our future success while maintaining disciplined cost management. In addition, we continue to prioritize winning new logos and cross-sell mandates releasing ACV to revenue and innovating MeridianLink One to meet the evolving digital lending needs of customers. With that, I'll share our updated guidance for 2024. For the fourth quarter, we expect total GAAP revenue guidance to be between $76 million and $80 million compared to $74.6 million for the same period 2023. This represents an estimated year-over-year change of 2% to 7%. For the full year 2024, we expect total GAAP revenue to be between $313 million and $317 million, compared to $303.6 million for the full year 2023. This represents an estimated increase of 3% to 4% year-over-year. We expect the mortgage market to contribute approximately 20% of GAAP revenue for the fourth quarter and for the full year 2024. I will now provide more color around the drivers of our 2024 total revenue. For non-mortgage lending revenue, we expect mid to high single-digit growth year-over-year driven primarily by ACV release. Our mortgage-related revenue guidance includes declining year-over-year revenue. It will take time for recovery in volumes to push a significant portion of our customers above their committed minimums as the majority are currently below them. Additionally, we continue to realize the impact of downsell and customer churn. For our non-mortgage-related data verification software solutions, we expect broadly flat growth year-over-year as hiring has taken more time to recover. Now focusing on our adjusted EBITDA guidance. Fourth quarter estimated adjusted EBITDA is expected to be between $29.5 million and $32.5 million, representing adjusted EBITDA margins of approximately 40% at the midpoint. For the full year 2024, we expect our adjusted EBITDA range to be between $127 million and $130 million, representing adjusted EBITDA margins of approximately 41% at the midpoint. To provide more color around the non-GAAP expense drivers of our adjusted EBITDA guidance for 2024, gross margin is expected to be in the low 70s. R&D is expected to be significantly lower year-over-year due to our restructuring earlier in the year. Sales and marketing as a percentage of total revenue is expected to be higher year-over-year as we have invested in our go-to-market team. G&A is expected to be higher as a percentage of revenue year-over-year, reflecting select discretionary investments made to position the company for scale in 2025 and beyond. Our adjusted EBITDA guidance reflects the same cost discipline that we demonstrated in Q3. Until we have greater conviction around the recovery in volumes from the macro and political environment becoming more certain, we will remain focused on managing our costs and releasing ACV to drive performance. I will end where I began today. I believe we have the foundation for scale and a strong leadership team in place to take the company to the next level. I look forward to finishing the year strongly and capitalizing on the growth opportunities that lie ahead. With that Nicolaas, Larry and I are happy to take any of your questions and I'll turn it over to the operator. Operator Question-and-Answer Session Operator Thank you. Ladies and gentlemen, we will now begin the question-and-answer session. [Operator Instructions] Your first question comes from Parker Lane from Stifel. Your line is now open. Please go ahead. Unidentified Analyst Tom [ph] for Parker. Thank you for taking my questions. To start you mentioned, the ACV release contributing high single digits to revenue growth. Can you just provide a little bit on what you're doing to accelerate the release of that and going forward? Thank you. Larry Katz It's Larry. Thanks for joining. Look we had a strong quarter on ACV release. That's -- I wouldn't say that it's accelerating. It's -- ACV release is driven by bookings and then services delivery. And the growth in ACV release is really driven by bookings growth over prior periods. In the past, we had accelerated delivery due to some changes in our services delivery team and that had accelerated. But the growth in this period was not driven by that process change so to speak. We're kind of -- we're at stable delivery times. It's really driven by bookings and bookings release. Unidentified Analyst Okay. Got it. And then, secondly you mentioned, mortgage headwinds still continuing. Do you have any update on, when you would think that that would kind of flip around? And would the election results from this week have any impact on that? Nicolaas Vlok Hi. This is Nicolaas. We still are in the phase of generational lows in mortgage volume. We don't anticipate a fast return to normal. If you take a look at where rates are and where mortgages have been issued over the call it the COVID and more recent times, mortgage rates will need to drop below five for it to have a meaningful impact on the business and volumes for us. So we anticipate this to be quarters and not near-term. Unidentified Analyst Okay. That's all. Thank you for the help. Operator The next question comes from Cris Kennedy from William Blair. Your line is now open. Please go ahead. Cris Kennedy Yeah. Good afternoon. Thanks for all the information. When you think about your business in a normalized environment can you just talk about what you think the revenue can grow at going forward? Elias Olmeta Hi. This is Elias. Yeah. In a normalized environment which we clearly aren't in and as Nicolaas and Larry alluded to, it's going to take us a while because we are facing some headwinds across different parts of our portfolio both on the mortgage side the auto side. All of that being said, as we do enter into a normalized environment and volumes pick up what you'll see flowing through is our revenue algorithm. Volumes will flip from a small drag across the company to -- and it's going to somewhere in the mid-single digits. And if you think about that in the context of where consumer performed for the quarter it's not hard to see us ultimately performing near, where we have set long-term guidance which is in the mid-single digits. Cris Kennedy So, mid-single digits, for revenue growth. Elias Olmeta I'm sorry. Excuse me mid-teens. Excuse me. Nicolaas Vlok Double digits. Elias Olmeta I misspoke, Mid-teens. Cris Kennedy Yeah. Okay. So it's consistent with what you've said historically. Okay. Got it. Okay. Thank you for taking my question. Operator The next question comes from Alex Sklar from Raymond James. Your line is now open. Please go ahead. Jessica Wang Hi. This is Jessica, on for Alex today. Thanks for taking my question. I just want to start off with double-clicking on cross-sell. What are some key factors that have been driving success in cross-sell? Have there been any shifts in customer priorities that are elevating demand for certain capabilities over others? Thanks. Larry Katz Hey. It's Larry. Thanks for the question. Look, cross-sell is a big part of our business. As a vertical SaaS company with land-and-expand motion cross-sell is a big part of our bookings and our pipeline. I wouldn't say the priorities have shifted, but I'll just highlight the -- number one is we're a platform play with the variety of solutions. And so on the consumer side there's always the natural expand the cross-sell from their initial buy to the extended modules. So for example, if they start with account opening and direct auto lending for example; adding indirect lending, adding personal loans, credit cards, whatnot, that is the -- that's the first primary motion for cross-sell. The second, which I highlighted in my prepared remarks is mortgage. And that is a real opportunity that we do see accelerating, both consumer cross-selling in -- customers with consumer solutions cross-selling into mortgage and mortgage cross-selling into consumer. That bidirectional cross-sell is a very strong motion, and we think there's opportunity there. And there's quite a bit of interest in the market there. And then three is the data and analytics, right? As a platform play, one of the differentiators is that we have data across the consumer debt wallet. And really, that enables our customers to deliver personalized offers things like debt optimization, for example, to a consumer. And so the data and analytics modules is an area of interest as well. Jessica Wang Got it. That's really great. A follow-up question. Do you see a potential for the macro environment being more friendly to M&A activity among financial institutions? And if this does play out, do you see this having a potential impact on your customer base and performance due to M&A activity? Thanks. Nicolaas Vlok Hi. This is Nicolaas. From a macro and M&A perspective, we expect with rates coming down to drive increased activity in M&A. We are also over time seeing valuation expectations adjusting more. So my perspective is that there would be generally speaking, more M&A activity. And one of the catalysts would be macro and interest rates coming down. Anything you want to add, Larry? Larry Katz Yeah. Maybe I'd just add. Specifically, I think your question is around the -- around our end market, right, consolidation in our end market, if I heard that right. And clearly, there's been a lot of discussion around consolidation in banking over the past 24 hours. I do think that there will be -- look, we've been in a consolidation trend in banks -- in community banks and in credit unions over a period of time. I think that will continue. I think we should expect it to continue. Our experience is that we tend to be a beneficiary there because we tend to serve our clients -- our customers tend to be those larger institutions that are using technology and have invested in technology and they're the winners in the market. And so they tend to be the consolidators. And so that gives us -- as consolidation happens, that's a win for us because our end customers are the buyers. Nicolaas Vlok The digital forward banks. Jessica Wang Thank you. Operator There are no further questions at this time. I will now give back the call over to Nicolaas Vlok. Please go ahead. Nicolaas Vlok As we close out the call, I want to express my sincere gratitude to our outstanding team. Your dedication and commitment have been instrumental in achieving a solid Q3 and are the reason MeridianLink is differentiated in the market. In fact, I'm proud to share that in Q3, IDC included MeridianLink in the top 50 of its 2024 Global FinTech 100 list. This achievement would not be possible without the strength and innovation of our team. Thanks to everyone for listening in, and we look forward to speaking with you again soon. Operator Ladies and gentlemen, this concludes today's conference call. Thank you for your participation. You may now disconnect. Join the conversation - create a free Seeking Alpha account today. Gain insights from thousands of investors sharing their opinions and strategies."
    }
]