[
    {
        "Date": "2025-02-18",
        "Source Name": "fool.com",
        "Source URL": "https://www.fool.com/quote/nyse/mlnk/",
        "Extracted Text": "MeridianLink, Inc. operates as a holding company, which engages in the provision of cloud-based digital solutions. The firm offers its solutions to financial institutions including banks, credit unions, mortgage lenders, specialty lending providers, and consumer reporting agencies. The company was founded in May 2018 and is headquartered in Costa Mesa, CA. The Q2 earnings update contained a few surprises. MLNK earnings call for the period ending June 30, 2022. MLNK earnings call for the period ending March 31, 2022. MLNK earnings call for the period ending December 31, 2021. MLNK earnings call for the period ending September 30, 2021. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. ABOUT THE MOTLEY FOOL OUR SERVICES AROUND THE GLOBE FREE TOOLS AFFILIATES & FRIENDS"
    },
    {
        "Date": "2025-02-18",
        "Source Name": "fool.com",
        "Source URL": "https://www.fool.com/earnings/call-transcripts/2022/03/11/meridianlink-inc-mlnk-q4-2021-earnings-call-transc/",
        "Extracted Text": "MLNK earnings call for the period ending December 31, 2021. IMAGE SOURCE: THE MOTLEY FOOL. MeridianLink, Inc. (MLNK -1.96%) Q4 2021 Earnings Call Mar 10, 2022, 5:00 p.m. ET Operator Ladies and gentlemen, thank you for standing by and welcome to MeridianLink's fourth quarter and fiscal year 2021 earnings call. At this time, all participants are in listen-only mode. After the speaker's presentation, there will be a question-and-answer session. Please be advised that today's conference is being recorded. I would now like to turn the conference over to your first speaker today, Erik Schneider, head of investor relations. Erik, please go ahead. Erik Schneider -- Head of Investor Relations Good afternoon, and welcome to MeridianLink's fourth quarter and fiscal year 2021 earnings call. We will be discussing the results announced in our press release issued after the market closed today. With me are MeridianLink's chief executive officer, Nicolaas Vlok; and chief financial officer, Chad Martin. Before we begin, I'd like to remind you that today's conference call will include forward-looking statements based on the company's current expectations. These forward-looking statements are subject to a number of significant risks and uncertainties, and our actual results may differ materially. For a discussion of factors that could affect our future financial results and business, please refer to the disclosure in today's earnings release and the other reports and filings we file from time to time with the Securities and Exchange Commission. All our statements are made based on information available to us as of today. And except as required by law, we assume no obligation to update any such statements. During the call, we will also refer to both GAAP and non-GAAP financial measures. You can find the reconciliation of our GAAP to non-GAAP measures included in our press release, which is posted to the Investor Relations section of our website. With that, let me turn the call over to Nicolaas. Nicolaas Vlok -- Chief Executive Officer Thank you, Erik, and good afternoon, everyone. Thank you all for joining us for our fourth quarter and fiscal year 2021 earnings call. 2021 was a very successful year with strong growth, and Q4 continued to show strong momentum outside the expected slowing in mortgage-related revenues. As a result, MeridianLink exceeded guidance again in Q4 with GAAP revenue up 19% year over year to $64 million and 38% adjusted EBITDA margins. In a few minutes, Chad will provide additional details on these results and provide 2022 guidance. But first, I will provide some details on what we are seeing in the macro backdrop and on key areas of strength during the quarter. We continue to see notable strength in the consumer lending side of our business with strong momentum in the fourth quarter, up 23% year-over-year. This strength has been driven in part by the reinvestment of our mortgage-related upside into the rest of our lending business. In line with our guidance, the impact of mortgage on both our lending software and data verification software revenue types declined in the fourth quarter. Mortgage came in at approximately 27% of revenues during the quarter, and we expect this percentage to decline further in 2022 due to both the expected weakening of mortgage volumes and to the continued outperformance of our consumer lending solutions. As you know, MeridianLink One is a comprehensive, consolidated all-in-one cloud platform that supports all consumer loan and account types, including mortgage. We believe MeridianLink is outperforming in our market due to our diversified portfolio of products offered in our integrated platform and the continuing strong digitalization tailwinds. Moving on to key areas of strength. There are three things I would like to talk about: one, our increasingly robust go-to-market engine and how that is driving continued momentum in both new logo ones and cross-sell; two, innovation, including product suite integration, modernization, and expansion and how this is driving One; And thirdly, reduced implementation times and how these are driving faster go-lives and helping us to invoice sooner. So let's talk about these three in more detail. Q4 was a record bookings quarter for us with new logos wins the highest ever, driven by continued investment in our go-to-market engine. We now have nearly 50 quota-carrying reps in the field, and digitalization is top of mind for customers and prospects. Our return on this investment has been tremendous, generating high demand from potential clients. We will continue to invest both in strengthening our position in our sweet spot and extending beyond it, unlocking new market opportunities. One large Q4 opportunity was a win from a fast-growing digital mortgage platform designed exclusively for small to midsized mortgage lenders with more than $150 billion funded in working with more than 300 lenders. They invested more than $1 million in MeridianLink Mortgage in year one, and we are confident enhanced messaging of MeridianLink's open API technology, multitenant architecture and collaborative approach to growing clients' businesses will continue to drive larger lands. Conversely, MeridianLink entry has enabled wins of institutions smaller than our typical customer through a wholly templatized implementation. These are smaller dollar contracts than our typical customer, but it further extends our market-leading capabilities to institutions of all sizes who are committed to providing the best capabilities in the market. In addition, cross-selling is accelerating. In Q4, a $500 million-plus national credit union added MeridianLink Opening to their portfolio of MeridianLink products, which now includes MeridianLink Consumer, MeridianLink Portal, and MeridianLink Consulting. Secondly, our commitment to delivering innovation that is meaningful to our customers is also driving momentum. When new logos or current clients select MeridianLink, they repeatedly save a trust MeridianLink to help grow their business because of our market leadership and innovation. We continuously improve solutions for all clients. Most recently, for CRA clients, we combined the leading independent credit background and tenant screening platforms. In lending, we brought together leading independent products for credit unions and community banks across consumer point-of-sale, account opening, deposit taking, direct lending, and indirect lending. We also launched MeridianLink Engage in beta in Q4 and expanded to general availability in January. Engage is a unique and comprehensive end-to-end consumer lending, account, and card marketing automation solution, and we are seeing good initial engagement from prospects at the top of our sales funnel. Our engineering team also migrated MeridianLink Portal for consumer lending from our hosting environment to the public cloud in Q4. This is our largest migration to date, and it allows us to offer increased scalability and higher speed to clients while improving our ability to iterate and improve the underlying product technology. In 2022, we will complete the MeridianLink One platform rollout, providing the full breadth of our lending solution in the public cloud with a unified user experience. Thirdly, organic and inorganic investments in both solutions and go-to-market activities have meaningfully increased our bookings rate. And on the last call, I told you client demand for our capabilities, exceeded our ability to implement them. COVID-19 increased customer demand for integrated, comprehensive digital processes but slowed implementation since portions of the go-live process need to be performed synchronously to accomplish these best outcomes. As mentioned previously, we have developed and launched standardized product and service packages that bring smaller clients live more quickly and using up to two-thirds less effort from our professional services team. We also invested in process improvements that accelerate the portion of the implementation timeline we control. This helped us close the year with an accelerating number of go-lives across core products. We expect the investments completed and underway in our services team to reduce total time from signing to go-live by about 30%. These investments are necessary to work down our backlog and keep up with the ongoing growth in bookings. We expect a very strong return on the spend, bringing clients online faster as a meaningful financial impact. Before I turn the call over to Chad, I want to give you some high-level thoughts on 2022. When we think about 2022, we are more confident than ever in our go-to-market and innovation engines. We are penetrating more of our TAM as we continue to win opportunistically outside our sales sweet spot. Our cross-sell muscle is building, and we are increasingly monetizing our partner marketplace. MeridianLink will also remain a disciplined company in 2022. We've been able to deliver consistent double-digit top-line growth, along with profitability levels well above those of our public fintech peers. None of this is new. This is what you have come to expect of MeridianLink. The big story for 2022 will be bringing customers online more quickly. I mentioned the investments we are making, and we'll continue to make in our go-to-market organization. This is what we have guided for. But candidly, we have been more successful than we anticipated in generating demand and have proven that adding to our go-to-market organization produces very high returns. We will continue to ramp up our sales and marketing team to leverage our already strong position and create further distance between us and the competition. As a result, we are increasing investments to accelerate implementation capacity. As we increase hiring, we expect short-term margin pressure, but this investment will allow us to bring recurring revenue online more quickly and improve the go-live experience for our customers. As we closed out the last quarter of our first year as a public company, I'm pleased to see our strong execution on key growth initiatives, and I'm confident this success will continue. As always, I'd like to thank our employees. It is their dedication to and collaboration with our customers that drives our momentum. We also want to thank our new and existing customers for their trust in us to drive outcomes for their clients and communities. I will now turn the call over to Chad to talk about our financial results. Chad Martin -- Chief Financial Officer Thanks, Nicolaas, and thanks again to everyone for joining us today. Since this is our first year-end earnings call, I'll start by providing the highlights for the quarter and the year. Then I will recap the highlights of our financial model and provide our results in more detail before finally giving guidance for the first quarter and full-year 2022. As Nicolaas mentioned, in the fourth quarter, we generated total revenue of $64 million, up 19% year over year. 87% of our fourth quarter revenues were subscription fees with the balance coming from professional services and other. Our operating income was $7.8 million, but our non-GAAP operating income was $11.7 million, and adjusted EBITDA was $24.6 million. For the full year 2021, operating income was $37.7 million. Our non-GAAP operating income was $70.8 million, and adjusted EBITDA was $123.4 million for the year. Our IPO was completed during the third quarter. So the fourth quarter of 2021 gives an indication of what we believe is the likely level of ongoing stock-based compensation and public company reporting costs. We have a usage-based SaaS recurring revenue model. Our customers signed long-term contracts, usually three years ,that are not cancelable without penalty and which auto-renew at the end of term. Typically, customers commit to annual fees and monthly purchases of applications. In exchange for higher monthly commitment, they receive lower per application pricing, and any transaction over the monthly minimum commitment is an incremental charge. Our platform's ability to make our customers more efficient and effective at lending naturally drives more volume once it is installed and used. We can grow with our customers, and we are aligned with their success. We provide both lending software solutions and data verification software solutions. In the fourth quarter, lending software solutions revenues accounted for nearly 68% of our total revenue and grew 18% year over year. The remainder of our revenues come from data verification software solutions, which increased 20% year over year. For the full year 2021, lending software solutions revenues accounted for nearly 66% of our total revenue and grew 32% year over year. The remainder of our revenues come from data verification software solutions, which increased 39% year over year. Fourth-quarter revenues from the mortgage loan market generated 27% of our overall revenues. Specifically, 9% of our lending software solutions revenues and 68% of our data verification software solution revenues were tied to our mortgage-focused products. For the full year 2021, revenues from the mortgage loan market generated 30% of our overall revenues, composed of 9% of lending software solutions and 70% of data verification software solutions. Of our 19 points of year-over-year revenue growth in the fourth quarter, 13 points were contributed by the acquisitions of TCI and TazWorks, while the remaining growth came primarily through the addition of new customers, increased module penetration of existing customers, and increased volume from our customers. As a reminder, TCI was acquired during the fourth quarter of 2020, so the growth contribution this quarter is less than in previous quarters of 2021 as TCI revenue was partially in the 2020 comparable base. As expected, organic growth from data verification software solutions trended lower year over year, but growth from lending software solutions, excluding TCI, remained robust, growing double digits versus the prior-year period. Gross margin in Q4 was 65%. But adjusted for stock-based compensation, it was 72%. We continue to invest in our sales and marketing and R&D efforts to drive organic growth acceleration. We are investing significantly to build robust sales and marketing capabilities. Compared to the fourth quarter last year, we spent 53% more in sales and marketing and 48% more in R&D adjusted for stock-based compensation. With this additional spend, our adjusted EBITDA margin was 38%, and our adjusted EBITDA decreased by approximately $3.7 million to $24.6 million. For the full year 2021, sales and marketing and R&D spend grew by a total of 76% and 57%, respectively, again, adjusted for stock-based compensation. 2021 EBITDA grew by $18.8 million to $123.4 million or 18%, and EBITDA margin was 46%. We will continue to invest to accelerate our underlying growth in 2022. Turning to the balance sheet and cash flow statement. We ended the fourth quarter with $113.6 million in unrestricted cash and cash equivalents, up $20.6 million from the end of the third quarter. In the fourth quarter, we completed the refinancing of our credit facility. We were able to extend the duration of our term loan and increase the size of our revolving credit facility while reducing the initial floating interest rate by 50 basis points. Operating cash flow in the fourth quarter was $20.8 million, and free cash flow was $19.4 million in the fourth quarter or a 30% free cash flow margin. For the full year 2021, operating cash flow was $89.8 million, and free cash flow was $84.1 million, or a 31% free cash flow margin. We continue to generate funds that can be used to invest in the business, pursue acquisitions or deleverage. I will now conclude the call by providing guidance for Q1 and for the full year of 2022. Overall, we continue to see strong business momentum, and our pipeline remains robust. For the first quarter, estimated total revenue is expected to be between $68.3 million and $69.3 million, compared to $67.8 million for the same period in 2021. This represents an estimated increase of 1% to 2% year over year. In the first quarter of 2021, the mortgage market contributed $22.7 million of revenue to MeridianLink, or just over one-third of our revenue in the year-ago quarter. We expect the mortgage market to contribute only 24% of revenue for the first quarter of 2022. On a non-GAAP basis, our first quarter estimated adjusted EBITDA is expected to be between $26.5 million and $27.5 million, representing EBITDA margin of approximately 39% at the midpoint of the range. For the full year 2022, estimated total revenue is expected to be between $288 million and $292 million compared to $267.7 million for the same period in 2021. This represents an estimated increase of 8% to 9% year over year. On a non-GAAP basis, our full-year 2021 estimated adjusted EBITDA is expected to be between $112 million and $116 million, representing EBITDA margins of approximately 39% at the midpoint of the range. This lower year-over-year margin reflects anticipated increases in annual spending, as described earlier by Nicolaas, totaling approximately $15 million. As we've communicated previously, we will continue to invest in areas to drive future growth and the investment in sales and marketing to drive bookings, the investment in services capacity to convert bookings to revenue, and the investment in development and the cloud to both enhance and expand our product suite are all items that will require current expense that we expect will lead to future returns. Entering 2022, TCI and TazWorks have been part of our company for at least a year, so we will no longer be calling them out separately from our base. The normalization of activity in the mortgage lending market appears to be well underway. We expect this to be a minor headwind in lending software and a more meaningful drag on data verification software performance in the quarters ahead. Overall, the mortgage-related percentage of our revenue in 2022 is expected to decrease to the mid-20s, down from 30% in 2021. This reduction is less than previously anticipated as we have continued to add new mortgage LOS clients. Our existing clients have shown an ongoing ability to win market share in the tougher overall volume environment we are currently experiencing, and we are finding ways to augment our solutions with additional data items and partners to provide more value to our customers and, therefore, more revenue for ourselves. With that, Nicolaas and I are happy to take any of your questions. Operator? Operator Sure, sir. [Operator instructions] Your first question comes from the line of Koji Ikeda with Bank of America. Please go ahead. Koji Ikeda -- Bank of America Merrill Lynch -- Analyst Hey, guys. Thanks for taking my question. Just a couple for me here. First one on Engage. Congrats on getting that generally available earlier this year. Just wondering with the release of Engage, would that cause any sort of sales cycle pause maybe from the end market trying to digest or fully digest what this new product is? And maybe any sort of color on what this Engage product could be replacing? Is it a greenfield opportunity? And any kind of uplift this new product could be for existing customers? Nicolaas Vlok -- Chief Executive Officer Good afternoon, Koji, and thank you for your question. First of all, we've been communicating to the market that we would be launching in Q1, and we've seen a good success in the beta program in Q4, so we decided to bring to market and launch in January. Since then, we've seen great activity at top of funnel exceeding our expectations. And the sales cycle will continue to roll out, but it will turn into a booking, which will then move over to our operations group and be implemented in time and turn into revenue. From an opportunity standpoint, it's automation and analytics. It is, to a large extent, a greenfield opportunity in our customer base. There are some solutions available that have been available through our partner and marketplace but is not nearly as integrated and as real-time as the Engage offering that we've launched. And we're very excited about it. We've received great feedback to date from clients who have been testing it and add a lot of sales activity since launch in January. Koji Ikeda -- Bank of America Merrill Lynch -- Analyst Got it. Thanks, Nic. And then just one follow-up for me here. OK, so you ended the year with 50 quota-bearing reps. Thanks for that visibility there. And then it sounds like you guys are investing for growth. So just thinking about the QBR specifically, how should we be thinking about the pace of new capacity from here? And how is the hiring environment been for you? Nicolaas Vlok -- Chief Executive Officer Let's start with the second part of the question. The hiring environment is pretty much as challenging as you can imagine, and I'm sure you're hearing it from other companies too. It's more challenging finding good skills today than it's been in my time with MeridianLink for more than 3 years. We do, however, keep finding talent. And when we bring talent onboard, invest on the onboarding and making our new employees part of the family, and train them as quickly as we can to be productive as new members to the team. In terms of ramping, the investments -- the way I would be thinking about the investments, we're sitting on a significant backlog, given the five, six quarters of outperformance in bookings and success. And the investments we're making in our services group is our highest priority investment in scaling. It's business that's contracted. It's in the bank. It's basically checks. We need to go cash. And to me, it's one of the low-risk investments you can make in today's market and climate and accelerate the business. And we're confident that it would yield a great ROI. Also, on the sales side, services being the larger part of the investment, but on the sales side, we continue to invest. But it's probably not going to be at the same clip you've seen over the last 12 to 18 months. But we find great opportunity. We continue to put more product into the field. Some of our lesser-known products, like our Collect product and our analytics products, for example, are getting more airtime and getting more focus. And then also from an Engage standpoint, lots of activity. So from my perspective, the focus is on services, but there's definitely a ramp on the sales side to kind of bring the two together. And by the end of 2022 have that pretty much in sync where the selling and the implementation isn't yielding a growing backlog anymore. Koji Ikeda -- Bank of America Merrill Lynch -- Analyst Got it, got it. Thanks, Nic. Appreciate the commentary. Thank you. Nicolaas Vlok -- Chief Executive Officer You're welcome. Thanks for asking, Koji. Operator Your next question comes from the line of Timothy Chiodo with Credit Suisse. Please go ahead. Timothy Chiodo -- Credit Suisse -- Analyst Great. Thanks a lot for taking the question. I have one just around general business and industry trends and then another, just a quick follow-up on the guidance and the incorporation of StreetShares. The first one is I know we've talked in the past about sometimes during an RFP process, you'll actually join forces with some of the large incumbent core banking platforms, the Fiserv, FIS, and Jack Henry's of the world. Just wondering if you've seen any kind of change in that trend if you're still seeing RFPs where you go together in joint to win business together and if you could just touch on that topic generally. And the quick follow-up is just around the guide. If you could just give any of the contributions that might be embedded from the StreetShares acquisition? Nicolaas Vlok -- Chief Executive Officer Sounds good. I'll respond to the go-to-market RFP question, and I'll let Chad speak to the guidance question here. We still go to market where we are Switzerland to the cores. We believe that's our best positioning in the market, and we're happy to work with cores and integrating to cores and additional cores. We continue to work deals alongside cores in all the names you have listed. In fact, some of our larger opportunities are very tightly integrated sales initiatives where we and cores have partner and keep moving the deals forward and keep pushing an outcome together. So from my perspective, no change in that environment to date. Chad, do you want to speak to StreetShares? Chad Martin -- Chief Financial Officer Sure. Tim, thanks for the question. So our guidance today doesn't include any impact of StreetShares. That deal was just announced. It has not yet closed. And when it does close and the timing of the close is known, we'll then be able to put it into the guidance. And we'll provide on our next call, presuming we close by that time, how StreetShares will be added to the view for the year. I would say that the acquisition itself is not material to the overall financial picture. So I wouldn't expect to see a material change in the financial guidance when we give it, but we certainly will incorporate it into the next update. Timothy Chiodo -- Credit Suisse -- Analyst That's excellent. Thank you for both of those answers. Really appreciate it. Thanks a lot. Nicolaas Vlok -- Chief Executive Officer Thank you for the questions, Timothy. Chad Martin -- Chief Financial Officer Yes. Operator Thank you. Your next question comes from the line of Saket Kalia with Barclays. Please go ahead. Saket Kalia -- Barclays -- Analyst OK, great. Hey, guys. Thanks for taking my questions here. Nicolaas, maybe just to start with you, kind of zooming out a little bit. I was wondering if you could just talk a little bit about what your customers are saying about their consumer lending businesses right now amid sort of the rising interest rates. I think that consumer loans are going to be less rate-sensitive than mortgages, for example. But I'm just kind of curious, just broadly how your customers sound about those businesses currently. Does that make sense? Nicolaas Vlok -- Chief Executive Officer It makes sense. And good afternoon, Saket, and thank you for the question. I agree with you in terms of your perspective that consumer lending will be less rate-sensitive, and mortgages will be more rate-sensitive. And my perspective, given most of our clients are deposit-retaking institutions, they would welcome a more normalization of rates over time. And I actually believe and think they could be upside for our customers as nondepository competition will be facing rising cost of capital in a rising interest rate environment. So very much agree with the analysis that you've laid out. And I believe it will be a net benefit over time for the largest part of our customer base. Saket Kalia -- Barclays -- Analyst Got it, got it. That's helpful. That makes sense. Chad, maybe for the follow-up for you. I was wondering if you could just touch a little bit on gross margins a bit and kind of how you're thinking about those going forward. And maybe part of this is relating back to Nicolaas' point just on incremental services investment, which presumably will be going into the cost of goods sold line. But I was just wondering if you could touch on that a little bit, whether that started here in the fourth quarter. And maybe just zooming out on gross margins, as we start to see that mix shift next year and going forward between lending and data verification, can you just touch on whether there's a material gross margin difference between those two? Chad Martin -- Chief Financial Officer Sure. Thanks, Saket. Appreciate the question. Touching on gross margins generally, we did see gross margins being slightly lower than our kind of long-term model in the fourth quarter and expecting that to continue into '22. And as you mentioned, a big component of that is that we will be augmenting our services capacity. And that capacity and those costs do flow through COGS as it relates to the services revenue. So we will see some bump in cost, therefore, a reduction in margin driven by the services. Now there will be services revenue attached to those investments as well. But the services revenue has a lower gross margin than the SaaS revenue does. Zooming out, like you said, we're looking at the mix shift, the SaaS margin, gross margin on data verification is lower than the SaaS margin on lending because we have the cost of the data elements of the data verification contained within the SaaS side. Conversely, there's less services on our data verification business than on our lending side. So there's not a real material difference ultimately on the gross margin between those two when you look at the overall mix of business. Saket Kalia -- Barclays -- Analyst And maybe if I could just sneak in one housekeeping question. Understanding that StreetShares hasn't closed yet. Is there anything that you can give us in terms of scale, whether that's revenue, whether that's number of employees? Anything that you can provide understanding that it still hasn't closed yet. Nicolaas Vlok -- Chief Executive Officer Chad, is there anything you want to add to that? Chad Martin -- Chief Financial Officer No. We'll be giving that guidance once it's closed, Saket. So I would point you to there, obviously, StreetShares as a web page that talks about the business, that you can glean information about. But we're not looking to provide really any details until we get to close. Saket Kalia -- Barclays -- Analyst Got it. Fair enough. Thanks, guys. Nicolaas Vlok -- Chief Executive Officer Thank you for the questions, Saket. Chad Martin -- Chief Financial Officer I appreciate it. Operator Your next question comes from the line of Matt VanVliet with BTIG. Please go ahead. Matt VanVliet -- BTIG -- Analyst Yes, good afternoon. Thanks for taking the question, guys. Maybe a bit of a maybe higher level question around sales activity as a follow-up to Saket's question. As the majority of your customers are depository institutions, even if rates aren't rising quite as quickly as maybe it looked like a few months ago, I think the overall trend certainly points to longer-term rates rising. So with that as a backdrop, are you seeing some of your customers or potential net new customers embracing the idea of investing in technology, especially in a bigger project undertaking like a lending system here? What's the overall appetite for spending balanced with ongoing uncertainty, whether it's from macro or even on the geopolitical side more recently? Nicolaas Vlok -- Chief Executive Officer Good afternoon, Matt, and thank you for your question. We still find ourselves in a very opportunity-rich environment. Hard to gaze into a crystal ball to see what the ultimate impact of the conflict will be. But from our perspective and our midsized clients', they're in a cycle where there's a real need for technology refresh. And it's driven -- it kind of was coming from a digitalization kind of cycle perspective for them too. But with the pandemic that we've dealt with to date, those clients are realizing that the consumers' expectations have shifted away from being in branch transactional to much more digital from an interface and communication standpoint, where branches are becoming more an advisory base and knowledge base visit and not purely a transactional visit. So from a business model standpoint, it's evolving. And we help the mid-market stay competitive to larger Tier 1 banks and larger FIs. And our positioning to date is we are a platform. We consolidate a number of single-point systems into a platform where decisioning is real-time, where analytics is real-time, and automation is to your benefit. And in past analysis of how MeridianLink customers are doing compared to non-MeridianLink customers, our customers typically outperform non-MeridianLink customers in loan growth. So my perspective is as long as the environment don't significantly weaken or worsen, we will continue to have a productive selling motion in the company. And we've seen that over the last five quarters. And we're sitting on a backlog that we are scaling toward delivering, contracts are signed, and we've come off our best quarter in terms of new bookings. So from my standpoint, nothing has significantly changed. It feels like the tailwinds are the same and may even be picking up a little bit, given the strength of pipeline and kind of larger deals that we've seen percolate through our funnel. Matt VanVliet -- BTIG -- Analyst All right, very helpful. And then, Chad, as we look at -- you're talking about a little bit better-expected performance on the mortgage side embedded in guidance. I guess can you help us think about how some of those net new mortgage LOS customers might be impacting that versus the expectation of -- especially the refinance market probably cooling off further? And then how much, I don't know, of conservatism or potential downside risk have you stripped out of the guidance as we think about kind of where ultimately it shakes out by the end of the year? Thanks. Chad Martin -- Chief Financial Officer Yes. Thanks, Matt. So on the mortgage side, as discussed, we are seeing -- the overall rate environment is having an impact on refinancings and those volumes. So we'll see those volumes roll through on the parts of our business that are tied to mortgage. So both on the lending side, the mortgage LOS and on the data verification side, whether we have the credit CRAs. But offsetting that decline in volumes is what you just referenced that we're doing. Obviously, we're having good success. It's a part of what Nicolaas talked about and the success in go-to-market and adding new mortgage LOS customers to kind of offset and defray what we're seeing in terms of volumes and then leveraging our relationship, our customers potentially gaining share as well as us finding new ways to add data and information into our credit reporting solutions to provide more value to our customers and, therefore, more revenue to us as we're actually able to pass that along in the form of more -- either having more of our partners added into our solutions or raising our own prices and pushing that through. So we think that that's -- we'd initially talked about in the past of seeing mortgage as a percentage of revenue going to the low 20s or teens. We're now expecting that to be in kind of the low to mid-20s for the year. And we think that's a conservative view, given where we see the market today. Matt VanVliet -- BTIG -- Analyst Wonderful. Thank you. Operator Thank you. Your next question comes from the line of Andrew Schmidt with Citi. Please go ahead. Andrew Schmidt -- Citi -- Analyst Hey, guys. Thanks so much for taking my questions here. I wanted to dig into the nonmortgage consumer LOS side. Can you talk about kind of the growth expectations embedded here for 2022? And then across the lending modules in the nonmortgage consumer LOS set, if you could just discuss perhaps where you're seeing the most demand, whether it's auto, card, personal, et cetera? Any color there would be great. Thanks a lot. Nicolaas Vlok -- Chief Executive Officer I would make the comment here. And Chad, if you want to step in where it's not a more high level, feel free to do that. But I would say, Andrew, we're living in an environment where we're performing, in my opinion, very well even with some of the headwinds, like supply chain constraints in auto and chips and new homebuilding material. And there's not a lone channel that I would say that really stand out in any way or shape. If you kind of follow what the market is saying or thinking about what shifts may happen, we're starting to hear our clients are looking and investing more in HELOCs as an example. But we really haven't seen that take off. I would say there's not an area that I would kind of highlight and say is worse on the consumer lending, mortgage, nonmortgage side to one another. It's kind of I think we're in a constrained world. Folks typically would initiate loans on assets and most of that we see or feel somewhat. My expectation is, and I don't have a crystal ball, that we're going to see '22 still being impacted by these constraints. Maybe things tend to ease up. You may have a better perspective than we do on it. But we, as a company, are doing everything that's within our control to maximize the opportunities for us, our clients, and the consumers. And whether it's investing in more integrations or assisting clients with better decisioning or better automation and marketing, whatever kind of helps us keep the flywheel moving for us and our clients, we have that control and we're doing it. But I don't have one channel that I would say is outperforming significantly over the other or another one that's kind of pulling everything down. It's worth in percentage points from trend lines of the past. Chad, is there's anything you want to add? Chad Martin -- Chief Financial Officer Yes, Andrew, the only thing I'd to add, as Nicolaas mentioned, is our expectation is that we see more of the same. So the impacts that we've seen through '21 on volumes on nonmortgage consumers were rolling forward. So anything that ultimately improves the market should be beneficial, but there's no expected big change to the up or the down, as Nicolaas mentioned. Andrew Schmidt -- Citi -- Analyst OK. Thats' very helpful. Thank you both for that. And then as a follow-up on MeridianLink One, it's good to hear about the progress. Maybe coming out of 2022 and into 2023, could you talk about just having that work substantially done, what that might mean for either net new or cross-sells? Just curious, at a very, very high level, can you remind us the potential benefits of bringing the platform together in a consolidated fashion? Thanks. Nicolaas Vlok -- Chief Executive Officer Great question. From -- we are committed and on track to have migrated our private cloud environments over to public cloud, which ties in with our MeridianLink One platform and also integrating acquired products into our platform in a more meaningful way. We've done that with Saylent. We will continue to bring a platform to market where customers have the ability to acquire certain aspects of the platform as a new standing product, take, for example, mortgage. But the benefit is really the single user interface, the single sign-on, the analytics that can be done, the data that's made available between various components of the platform. And moving into 2023 from 2022, we will only be doing it in our public cloud environment. And the benefits for us and our clients would be it's more scalable. We have the ability to scale into markets we're not in today. We can implement and take clients faster in an environment where we just light up additional instances in the cloud. But also over time, as we think about our business and growth trajectory for the long term, being in that kind of environment with a platform where you don't need to put data centers down in markets you choose to go to but going through a cloud platform, that gives you the ability and kind of the benefit of speed when you launch. So it's a strategic initiative for us, putting MeridianLink One out there for our clients, completing the move, as well as ensuring that this is our baseline investment that from a technology architecture standpoint, that's going to carry us for the next decade or longer and positioning the company to roll in acquisitions that's cloud-ready faster, scale the platform faster. The benefits to us and our clients are clearly there. And the good news is from a selling and go-to-market standpoint, it will be easier. I think it will help us also create a more scaled sales force when we're in an environment where you can really take the platform forward. So I would say, very excited, very confident in our ability to complete the transition. We've seen and achieved a great milestone in Q4 with the move of a very large component over to our public cloud environment, this part of MeridianLink One, and that momentum will continue throughout the year. And it will set '23 up and the go-to-market motion and our ability to light up customers faster. It will just be an environment that we've wanted for quite some time and we eventually will be there, and we're very excited about it. Andrew Schmidt -- Citi -- Analyst Got it. Thank you for that. And clearly, a lot of benefits on the demand side. But it sounds like also on the cost side, there could be some capex savings as well as you kind of move away from in-house data centers. Is that the right way to characterize it? Nicolaas Vlok -- Chief Executive Officer You can think of it in the context of capex moving away. But at the pace, we are growing and just kind of a little bit of color, our growth between '19 and '20, new customer growth was slightly less than 20%. And our new customer growth between '20 and '21 was in excess of 30%. It's nearly doubled. So I would tell you as the cost for us to expand our data centers is not where we want to make the investment. So yes, there will be savings on that front. But I believe with the backlog we have and then also the momentum we're starting to see in our business, especially bringing on new logos and cross-sell, the ideas is the benefits are tied into faster scaling the ability to grow your footprint at an accelerated pace, the ability to bring acquisitions into the fold faster and make it part of the platform. And while the capex may drop off, there's going to be an increase in opex that will keep pace with the new customer wins and the cross-sell as we keep scaling. So I don't want to just think the one drops off and the other one is not really increasing. Chad, anything you want to add there? Chad Martin -- Chief Financial Officer No. You said it, Nicolaas. We'll be moving capex to opex. And so we will see the decline in the capex, the pickup in the opex. We're kind of having to double spin now as we have both the data centers and the cloud infrastructure that we're moving to. So through time, we hope to only have the cloud costs carrying us forward and be able to see the reduction in the capex and the spend we've had on maintaining our own data center infrastructure. Operator Thank you. Your next question comes from the line of Alex Sklar with Raymond James. Please go ahead. Alex Sklar -- Raymond James -- Analyst Chad, you mentioned in the prepared remarks the idea of the trade-off of higher monthly commitments in favor of lower pricing. Can you just talk about if you've seen any noticeable changes in your revenue visibility in the sense of kind of going back to your customers and kind of ramping up what their monthly commitments are compared to prior years? Chad Martin -- Chief Financial Officer Yes. Thanks, Alex. So we have incrementally been working on moving customers to higher commitments in the contract process. For a number of these customers, they're already at a higher volume. So we're basically just locking in the revenue we're already receiving from these customers when we move them on to that committed construct. And for new customers, they're locked in at that commitment level. And then as their revenue grows through time, they may choose to step their commitment level up to receive lower pricing. But candidly, it's not been a big phenomenon of our customers looking to raise their commitments to take advantage of lower pricing. And the reality is -- but we have seen the revenue that is in that commitment category increase in light of bringing on these new customers and renegotiating existing contracts. So we have more revenue committed, but that commitment hasn't come really at the expense of having to take a much lower per app from each entity. Alex Sklar -- Raymond James -- Analyst Got it. OK. And then I don't know if Nicolaas or Chad want to take this one. But you talked a lot about the services backlog. And I'm just curious, given the revenue recognition model, how much of a leading indicator is that for logo growth or kind of what you can see in terms of accelerating subscription revenue growth in the end of '22 and '23? Chad Martin -- Chief Financial Officer Yes. So the revenue recognition is we're not recognizing revenue from these customers until they go live. And their contract period doesn't start until they go live as well. So we're not losing any contracted revenue during the implementation phase. Just as Nicolaas talked about, the faster we can get the customer live, the sooner we'll be able to receive and recognize the revenue. And candidly, the customer is happier because they get access to the technology sooner. So as the investment in the services capacity to speed time to market, time to implementation really is a win-win-win for the customer, for us, and for both the services and the SaaS revenue streams. So that is an indicator. And so as we are successful in doing that, we should see more customers coming online going forward for -- but what Nicolaas was talking about around the success in signing new logos, right, that success is what's building that backlog. So the leading indicator of Nicolaas having the sales success is pushing entities into the backlog that we're now going to convert into revenue more quickly. Alex Sklar -- Raymond James -- Analyst Got it. That's very helpful color. Thank you. Chad Martin -- Chief Financial Officer Thank you. Operator Thank you. Your next question comes from the line of Bob Napoli with William Blair. Please go ahead. Bob Napoli -- William Blair -- Analyst Thank you, and good afternoon. Nice quarter. So just on the guide, big picture question. I guess long-term target EBITDA margins, 43% to 48%, and I understand you're investing a lot and you have a lot of momentum in the business. And you're focused on growth. But just any thoughts on the timing or the trend that -- or any goals you have in moving toward that long-term target? Chad Martin -- Chief Financial Officer Yes, Bob, thanks for the question. So yes, so the guide, obviously, for the year is right around or just shy of 40% on the EBITDA. We still think the long-term target absolutely makes sense for us. We've talked about the investments we're making. We've talked about the impact on '22 on gross margin from the services investment we're making. But again, the ROI on that is, as Nicolaas said, cashing the checks. So that's positive. And then we think as we mix -- the mix moves more to SaaS, as the services move those entities into our SaaS revenue, we should see both the gross margins improve, which drag along the EBITDA margins, and also just converting the spend on R&D and sales and marketing. I talked about kind of the amount that we're spending on a year-over-year basis. Again, all of that is really to push and accelerate revenue. And when the SaaS revenue comes on at a higher margin, that will certainly, through time, pull us to the margins that we're targeting. Bob Napoli -- William Blair -- Analyst Thank you. And then, I guess, impressive 30% growth in new customers in '21. That's a nice acceleration. Is that -- I mean are you -- it seems like it's been -- the demand just broadly in the bank tech space and the fintech that you've seen, we've seen a lot of demand. But have you seen from your customer base a more aggressive posture and maybe this is a post-COVID posture in realizing the need for digital? And I know you've ramped up your marketing investment somewhat specific to you. But are you seeing a mindset change that's driving that? And is there a change in the ARR per customer? Are you adding larger customers? Nicolaas Vlok -- Chief Executive Officer Let me speak to the mindset. We definitely see an increased level of interest in our target segment of the market to invest in future technology. And I do believe the pandemic at a point in time paused and have folks to rethink what the business should look like for the next decade or longer. And not because I know what MeridianLink is investing in and doing, but I really believe we're at the right place at the right time with the right platform for the mid-market, and what we do resonates. We're not the cheapest solution in the market. And we're not a stand-alone solution that companies need to invest dollars and integrate across their technology landscape. We bring a platform that they can run a large portion of their business on. And financial institutions that are forward-thinking want to be more engaging with the broader customer base, tend to engage in various levels of interactions and discussions with us. Some may start with doing a whole bunch of webinars, learning more what we offer. Eventually, it turns into demos. We end up nurturing discussions and working with clients. And I think it's a mindset that we're starting to see where folks realize they can actually grow their business faster if they're more efficient if they have better access to data and they can make decisions faster in their business for their clients. And they also are starting to get to the point where they can offer the most competitive rates as they work with MeridianLink and analyze risk better in that whole cycle. So from my perspective, we resonate with a market segment that wants to serve their clients better, wants to outperform competitors who are not been investing to date yet. And our offering is, again my opinion, the market-leading offering with the integrations we have, the breadth of the platform, and how we accelerate and have these mid-market financial institutions kind of outperform non-MeridianLink fintechs. So the way I would think of it is, yes, people are starting to think about what the business is going to look like post-COVID, what should they be doing to attract new customers, new clients, new members and how can they be competitive in a world that has shifted and changed, where the branch isn't performing the same function that historically did before COVID. And when I speak to prospects when we connect with clients that are buying incremental MeridianLink solutions, that is certainly one of the most prominent themes of the discussion is just thinking about where the business will be in a year or two from now and even longer-term. Bob Napoli -- William Blair -- Analyst Great. Thank you. Appreciate the answers. Chad Martin -- Chief Financial Officer Bob, I would just add one comment. Yes, I would add one comment, which is I don't think we're noticeably seeing an increased ARR on new logo sales, right? We typically lead with consumer LOS, and then Nicolaas talked about how we're adding additional functionality and growing ARR through time. But I will say, we have focused on really kind of pruning the small end of our customer base, some of the smaller customers that came through the acquisitions we've done in the past year-and-a-half. And really, that's leading and you'll see that we're just having a higher ARR per customer as a result of that. Operator Thank you. Your next question comes from the line of Parker Lane with Stifel. Please go ahead. Parker Lane -- Stifel Financial Corp. -- Analyst Thanks for taking the question. Sort of a follow-up to the last one. If you just look at the overall SaaS spend of the financial services sector, I think you've highlighted that as a real tailwind in your business over the last few years. In the context of a more uncertain macro and thinking back to the company's history, what have you seen from these institutions in the face of an uncertain macro? Do you think there's any potential for them to perhaps pare back their spending? And then secondarily, what are some of the competing interests here? Are there places that they're looking to digitally transform where MeridianLink is trying to get in there and be the priority of choice for those customers as they think about the next digital transformation project they're taking on? Nicolaas Vlok -- Chief Executive Officer Chad, do you mind taking that one for a second? Chad Martin -- Chief Financial Officer Yes, no problem. Parker, I would say at a macro level, right, we're still seeing the trend of these institutions investing in technology. The depository institutions, there's still pressure from the neo banks, from the fintechs, from all the start-ups who are looking to propagate their new solutions. And so our customers, right, the community banks, the credit unions are very focused on keeping up in that marketplace. So we haven't seen any slowdown. And historically, even when times or looking farther back in time, even in difficult periods around more economic uncertainty, often that's the time that then folks are looking to turn to technology to find ways to attract customers to make better lending decisions. And again, our solutions basically help these entities attract deposits, basically attract lending, right, make loans and get interest income on those loans. And that's 80% of their top line. So having a solution ready to go out in a difficult market and find and continue to ensure that they're driving their top-line performance is something that we -- that's a conversation we relish having even if the overall environment gets a little bit more difficult. Parker Lane -- Stifel Financial Corp. -- Analyst Got it. Appreciate the feedback, Chad. Congrats on the quarter. Chad Martin -- Chief Financial Officer Thanks. Operator Thank you. And that concludes our question-and-answer session for today. I'll now turn the call back over to our CEO, Nicolaas Vlok, for closing remarks. Nicolaas Vlok -- Chief Executive Officer Thank you, operator, and thank you to all those who have joined us today for our first full-year review of our performance as a public company. And I'm really excited about our outperformance in this first year being public. And what I said earlier is it's even more remarkable, given the pressure from supply chain constraints and a normalizing mortgage environment, which, again, from my perspective, highlights the tremendous strength of our consumer lending business and also the opportunities ahead of us. As we look ahead, I am confident that our investments in 2022 will position us extremely well to continue to scale and accelerate the business. I'm looking forward to when these headwinds subside and, in fact, become tailwinds for us and as we are ideally situated to grow our market-leading position. In the meantime, we are confident we can deliver another year of strong revenue growth with best-in-class profitability. And lastly, I want to thank our amazing employees and our loyal clients who trust us and inspire us to be better every day. We've had an exciting week, and I'm looking forward to closing out our acquisition of StreetShares here. And I would love to officially welcome the team, the StreetShares customers, and their partners to the MeridianLink family. And thanks again. It's what I can say for your commitment to being on our call today. Really appreciate you joining, and have a great afternoon, evening, wherever you may be at. Operator? Operator [Operator signoff] Duration: 66 minutes Erik Schneider -- Head of Investor Relations Nicolaas Vlok -- Chief Executive Officer Chad Martin -- Chief Financial Officer Koji Ikeda -- Bank of America Merrill Lynch -- Analyst Timothy Chiodo -- Credit Suisse -- Analyst Saket Kalia -- Barclays -- Analyst Matt VanVliet -- BTIG -- Analyst Andrew Schmidt -- Citi -- Analyst Alex Sklar -- Raymond James -- Analyst Bob Napoli -- William Blair -- Analyst Parker Lane -- Stifel Financial Corp. -- Analyst More MLNK analysis All earnings call transcripts This article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy. STOCKS MENTIONED *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. RELATED ARTICLES Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. ABOUT THE MOTLEY FOOL OUR SERVICES AROUND THE GLOBE FREE TOOLS AFFILIATES & FRIENDS"
    },
    {
        "Date": "2025-02-18",
        "Source Name": "fool.com",
        "Source URL": "https://www.fool.com/author/20032?page=424",
        "Extracted Text": "INVEST SMARTER WITH THE MOTLEY FOOL HOW THE MOTLEY FOOL CAN HELP YOU Market beating stocks from our award-winning service Investment news and high-quality insights delivered straight to your inbox You can do it. Successful investing in just a few steps Secrets and strategies for the post-work life you want. Find the right brokerage account for you. Hear our experts take on stocks, the market, and how to invest. MOTLEY FOOL RETURNS Market-beating stocks from our award-winning analyst team. Calculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of 02/18/2025. Discounted offers are only available to new members. Stock Advisor list price is $199 per year. Calculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. ABOUT THE MOTLEY FOOL OUR SERVICES AROUND THE GLOBE FREE TOOLS AFFILIATES & FRIENDS"
    },
    {
        "Date": "2025-02-18",
        "Source Name": "marketbeat.com",
        "Source URL": "https://www.marketbeat.com/stocks/NYSE/MLNK/competitors-and-alternatives/#:~:text=The%20main%20competitors%20of%20MeridianLink,the%20%22computer%20software%22%20industry.",
        "Extracted Text": "Should you be buying MeridianLink stock or one of its competitors? The main competitors of MeridianLink include Q2 (QTWO), Intapp (INTA), GDS (GDS), Freshworks (FRSH), Asana (ASAN), Workiva (WK), Cellebrite DI (CLBT), Pony AI (PONY), Science Applications International (SAIC), and Zeta Global (ZETA). These companies are all part of the \"computer software\" industry. Q2 (NYSE:QTWO) and MeridianLink (NYSE:MLNK) are both computer and technology companies, but which is the superior stock? We will compare the two businesses based on the strength of their institutional ownership, valuation, earnings, media sentiment, analyst recommendations, profitability, risk, community ranking and dividends. Q2 beats MeridianLink on 11 of the 17 factors compared between the two stocks. Sign up to receive the latest news and ratings for MLNK and its competitors with MarketBeat's FREE daily newsletter. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools. FEATURED BY 345 N Reid Place, Suite 620, Sioux Falls, SD 57103 contact@marketbeat.com (844) 978-6257 © MarketBeat Media, LLC 2010-2025. All rights reserved. © 2025 Fair market value prices are updated every minute and are provided by Polygon.io. Other market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer."
    },
    {
        "Date": "2025-02-18",
        "Source Name": "stockanalysis.com",
        "Source URL": "https://stockanalysis.com/stocks/mlnk/statistics/#:~:text=Total%20Valuation,enterprise%20value%20is%20%241.84%20billion.",
        "Extracted Text": "MeridianLink has a market cap or net worth of $1.43 billion. The enterprise value is $1.82 billion. The next estimated earnings date is Tuesday, March 4, 2025, after market close. MeridianLink has 75.53 million shares outstanding. The number of shares has decreased by -4.69% in one year. The stock's EV/EBITDA ratio is 33.19, with an EV/FCF ratio of 24.07. The company has a current ratio of 1.86, with a Debt / Equity ratio of 1.13. Return on equity (ROE) is -10.62% and return on invested capital (ROIC) is 1.06%. In the past 12 months, MeridianLink has paid $29.02 million in taxes. The stock price has increased by +0.48% in the last 52 weeks. The beta is 1.00, so MeridianLink's price volatility has been similar to the market average. The latest short interest is 1.44 million, so 1.90% of the outstanding shares have been sold short. In the last 12 months, MeridianLink had revenue of $311.44 million and -$51.60 million in losses. Loss per share was -$0.67. The company has $82.27 million in cash and $470.67 million in debt, giving a net cash position of -$388.40 million or -$5.14 per share. In the last 12 months, operating cash flow was $76.47 million and capital expenditures -$809,000, giving a free cash flow of $75.66 million. Gross margin is 71.78%, with operating and profit margins of 5.07% and -16.57%. MeridianLink does not appear to pay any dividends at this time. The average price target for MeridianLink is $22.58, which is 19.03% higher than the current price. The consensus rating is \"Hold\". This stock does not have any record of stock splits. MeridianLink has an Altman Z-Score of 1.77 and a Piotroski F-Score of 5. A Z-score under 3 suggests an increased risk of bankruptcy. Daily market news in bullet point format. © 2025 Stock Analysis. All rights reserved."
    },
    {
        "Date": "2025-02-18",
        "Source Name": "marketbeat.com",
        "Source URL": "https://www.marketbeat.com/stocks/NYSE/MLNK/forecast/#:~:text=According%20to%20the%207%20analysts,the%20current%20price%20of%20%2418.97.",
        "Extracted Text": "Based on 7 Wall Street analysts who have issued ratings for MeridianLink in the last 12 months, the stock has a consensus rating of \"Hold.\" Out of the 7 analysts, 2 have given a sell rating, 3 have given a hold rating, and 2 have given a buy rating for MLNK. Enter your email address to receive the latest news and analysts' ratings for MeridianLink and its competitors. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools. FEATURED BY 345 N Reid Place, Suite 620, Sioux Falls, SD 57103 contact@marketbeat.com (844) 978-6257 © MarketBeat Media, LLC 2010-2025. All rights reserved. © 2025 Fair market value prices are updated every minute and are provided by Polygon.io. Other market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer."
    },
    {
        "Date": "2025-02-18",
        "Source Name": "coincodex.com",
        "Source URL": "https://coincodex.com/stock/MLNK/price-prediction/",
        "Extracted Text": "According to our current MLNK stock forecast, the value of MeridianLink, Inc. shares will rise by 0.39% and reach $ 19.04 per share by March 20, 2025. Per our technical indicators, the current sentiment is Bearish while the Fear & Greed Index is showing 39 (Fear). MLNK stock recorded 14/30 (47%) green days with 2.82% price volatility over the last 30 days. Based on the MeridianLink, Inc. stock forecast, it's now a good time to buy MLNK stock because it's trading 0.02% below our forecast, and it could be undervalued. If you short-sell $ 1,000.00 worth of MeridianLink, Inc. today and repurchase it on Dec 31, 2025, you could make a potential profit of $ 310.28, reflecting a 31.03% ROI over the next 315 days (fees are not included in this estimate). No highlights detected for MeridianLink, Inc. at this moment. Disclaimer: This is not investment advice. The information provided is for general information purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision. Over the next five days, MeridianLink, Inc. will reach the highest price of $ 18.97 tomorrow, which would represent 0.00% growth compared to the current price. This follows a -1.45% price change over the last 7 days. In 2025, MeridianLink, Inc. (MLNK) is anticipated to change hands in a trading channel between $ 13.08 and $ 20.84, leading to an average annualized price of $ 16.18. This could result in a potential return on investment of 9.85% compared to the current rates. Market forecasts for February suggest that MeridianLink, Inc. will decline by as much as -3.82%, establishing an average price of $ 18.25 for the month. The anticipated price fluctuation ranges from $ 17.68 to $ 18.97. This trend may offer a potential return of 6.80% compared to the current price. Analysts expect MLNK's price to rise in March, with a projected change of 2.14% compared to current rates. The asset may reach a high of $ 20.84 and a low of $ 18.38, averaging around $ 19.38. This prediction comes after a negative market performance in February, indicating a possible reversal of the trend. The potential ROI stands at 9.85%, suggesting a profitable opportunity for long traders. MeridianLink, Inc. is predicted to start the second quarter of the year with a potential decrease to as high as $ 17.98, which would mark a 17.08% change compared to the current price. MLNK is expected to trade between $ 15.73 on the lower end and $ 17.98 on the higher end, generating an average price of $ 16.99. Following a bearish trend in the previous 30 days, May is expected to continuation this momentum. MeridianLink, Inc.’s value is forecasted to decrease, potentially reaching an average price of $ 18.02. The price is predicted to fluctuate between a low of $ 15.72 and a high of $ 19.20. Heading into the summer, the price of MeridianLink, Inc. is forecasted to decrease to $ 17.40, rejecting May's momentum. Price predictions suggest a range between $ 16.27 and $ 18.71, with an expected value around $ 17.40. This could lead to a potential gain of 14.23%, indicating a bullish sentiment for the month ahead. Our market analysis anticipates a positive trend for MeridianLink, Inc. in July. The forecasted price range is between $ 15.77 and $ 16.65 for an average monthly price of $ 16.19. Investors could experience a potential gain of 12.23% if shorting MLNK at current prices. The algorithm assumes that MeridianLink, Inc. will increase to $ 14.20, rejecting July's market momentum. Our price prediction suggests a range between $ 13.68 and $ 15.76. This could lead to a potential gain of 16.95% (if you’d have decided to buy MLNK at current prices), indicating a bullish sentiment for the month. After a bearish showing in August, MeridianLink, Inc. is predicted to rise to $ 14.85 in September. The projected trading range is expected to span from $ 14.02 to $ 15.90. This suggests a positive market outlook, with a potential return of 16.17% for investors. With a negative market trend seen last month, MeridianLink, Inc. is expected to reject the trend in October. The projected monthly trading range is between $ 14.05 and $ 15.27, with the average monthly value sitting at $ 14.71, which would be a -0.89% decline compared to the previous month. This could offer investors a potential return of 19.52%. Forecasts for November suggest a shift of the market trend, with a potential price increase to $ 14.44. The expected price range lies between $ 14.14 and $ 14.75, influenced by last month's market performance. Investors may witness a potential gain of 22.24%, if they decide to buy MLNK at current prices and sell it at predicted rates. MeridianLink, Inc. is predicted to finish the year by changing hands in a trading channel between $ 13.08 and $ 14.29. This would entail that the price of MLNK decreased by -28.52% in comparison to today’s prices (assuming December’s average price of $ 13.56). In other words, investors would generate a potential profit of 24.65% if MLNK follows the prediction. In 2026, MeridianLink, Inc. is forecasted to trade in a price channel between $ 11.05 and $ 14.33. On average, MLNK is expected to change hands at $ 13.13 during the year. The most bullish month for MLNK could be April, when the currency is anticipated to trade -24.45% lower than today. Generally speaking, MeridianLink, Inc. price prediction for 2027 is bearish. The MLNK stock is forecasted to hit a high point of $ 19.11 in November and reach a low of $ 12.01 in February. Overall, MLNK is expected to trade at an average price of $ 14.89 in 2027. The outlook for MeridianLink, Inc. in 2028 indicates a possible downtrend, with an expected price of $ 15.94. This represents a -15.99% decrease from the current price. The asset's price is projected to oscillate between $ 13.35 in April and $ 18.45 in November. Investors could see a potential ROI of 2.72%, suggesting a challenging investment environment. Following a bearish trend in the previous year, 2029 is expected to reverse this momentum. MeridianLink, Inc.’s value is forecasted to decrease, potentially reaching an average price of $ 11.42. The price is predicted to fluctuate between a low of $ 8.31 in December and a high of $ 16.04 in January. Forecasts for 2030 suggest that MLNK will experience a moderate decline, with expected fluctuation ranging from $ 6.72 to $ 9.30. Investors might anticipate a potential ROI of 50.99%, aligning with a bearish outlook for the year. Over the next several years, MeridianLink, Inc. is projected to increase, with prices potentially reaching $ 20.84 by 2025. This represents a 9.85% gain from today's value. The long-term forecast suggests a bearish trend, with potential highs of $ 20.84 and lows of $ 6.72 over the period. Based on data from February 18, 2025 at 19:21, the general MLNK stock forecast sentiment is bearish , with 2 technical analysis indicators signaling bullish signals, and 22 signaling bearish signals. MeridianLink, Inc. stock forecast was last updated on February 18, 2025 at 19:21. Moving averages (MA) are a popular indicator in all financial markets, designed to smooth price action over a certain amount of time. They are a lagging indicator which means they are influenced by historical price activity. In the table below you can find two types of moving averages, simple moving average (SMA) and exponential moving average (EMA). The MeridianLink, Inc. stock forecast for tomorrow is $ 18.97, which would represent a -0.37% loss compared to the current price. In the next week, the price of MLNK is expected to decrease by -3.70% and hit $ 18.27. As far as the long-term MeridianLink, Inc. stock forecast is concerned, here’s what our predictions are currently suggesting: According to our MeridianLink, Inc. stock prediction for 2025, MLNK stock will be priced between $ 13.08 and $ 20.84 in 2025. According to our MeridianLink, Inc. stock prediction for 2030, MLNK stock will be priced between $ 8.31 and $ 16.04 in 2030. MeridianLink, Inc. stock would need to gain 425.21% to reach $100. According to our MeridianLink, Inc. stock forecast, the price of MeridianLink, Inc. stock will not reach $100. The highest expected price our algorithm estimates is $ 20.84 by 2025. MeridianLink, Inc. stock would need to gain 2,526.05% to reach $500. According to our MeridianLink, Inc. stock forecast, the price of MeridianLink, Inc. stock will not reach $500. The highest expected price our algorithm estimates is $ 20.84 by 2025. MeridianLink, Inc. stock would need to gain 5,152.10% to reach $1,000. According to our MeridianLink, Inc. stock forecast, the price of MeridianLink, Inc. stock will not reach $1,000. The highest expected price our algorithm estimates is $ 20.84 by 2025. Based on our MeridianLink, Inc. stock forecast, MeridianLink, Inc. stock is currently not a good stock to buy. This is because the price of MeridianLink, Inc. stock is expected to increase by -33.51% in the next year. The MeridianLink, Inc. stock price prediction for tomorrow is $ 18.97, based on the current market trends. According to the prediction, the price of MLNK stock will decrease by -0.37% in the next day. The MeridianLink, Inc. stock price prediction for next week is $ 19.04, which would represent a 0.39% gain in the MLNK stock price. According to our prediction, MeridianLink, Inc. stock will not go up tomorrow. Based on the current trends, our prediction estimates that the price of MLNK stock will decrease by -0.37% in the next day. Our prediction anticipates that MeridianLink, Inc. stock will go down tomorrow. Our forecast estimates that MLNK will lose -0.37% in the next day and reach a price of $ 18.97. MeridianLink, Inc. stock traders use a variety of tools to make a prediction on which way the MLNK market is likely to head next. These tools can roughly be divided into indicators and chart patterns. When trying to make a MeridianLink, Inc. stock forecast, traders also try to identify important support and resistance levels, which can give an indication of when a downtrend is likely to slow down and when an uptrend is likely to stall. Moving averages are among the most popular MeridianLink, Inc. stock prediction tools. As the name suggests, a moving average provides the average closing price for MLNK stock over a selected time frame, which is divided into a number of periods of the same length. For example, a 12-day simple moving average for MLNK is a sum of MLNK’s closing prices over the last 12 days which is then divided by 12. In addition to the simple moving average (SMA), traders also use another type of moving average called the exponential moving average (EMA). The EMA gives more weight to more recent prices, and therefore reacts more quickly to recent price action. 50-day, 100-day and 200-day moving averages are among the most commonly used indicators in the stock market to identify important resistance and support levels. If the MeridianLink, Inc. stock price moves above any of these averages, it is generally seen as a bullish sign for MeridianLink, Inc. stock. Conversely, a drop below an important moving average is usually interpreted as a negative forecast for the MLNK market. Traders also like to use the RSI and Fibonacci retracement level indicators to try and ascertain the future direction of the MeridianLink, Inc. stock price. When making a MeridianLink, Inc. stock forecast, most traders use candlestick charts, as they provide more information than a simple line chart. Traders can view candlesticks that represent the price action of MeridianLink, Inc. stock with different granularity – for example, you could choose a 5-minute candlestick chart for extremely short-term price action or choose a weekly candlestick chart to identify long-terms trends. 1-hour, 4-hour and 1-day candlestick charts are among the most popular. Let’s use a 1-hour candlestick chart as an example of how this type of price chart gives us information about opening and closing prices. The chart is divided into “candles” that give us information about MeridianLink, Inc.’s stock price action in 1-hour chunks. Each candlestick will display MLNK’s opening price, closing price, as well as the highest and lowest prices that MeridianLink, Inc. reached within the 1-hour period. This information makes it easier to make an informed price prediction. It’s also important to pay attention to the color of the candle – a green candle means that the closing price was higher than the opening price, while a red candle tells us the opposite. Some charts will use hollow and filled candlestick bodies instead of colors to represent the same thing. Just like with any other asset, the price action of MeridianLink, Inc. stock is driven by supply and demand. These dynamics can be influenced by fundamental factors, such as earnings announcements, new product launches, acquisitions and mergers, and other factors. The MLNK stock price can also be influenced by market sentiment, broader economic conditions, interest rates, inflation rates and political developments. Some traders try to identify candlestick patterns when making stock price predictions to try and get an edge over the competition. Some candlestick formations are seen as likely to forecast bullish price action, while others are seen as bearish. CoinCodex tracks 39,000+ cryptocurrencies on 300+ exchanges, offering live prices, price predictions, and financial tools for crypto, stocks, and forex traders. © 2025 CoinCodex. All rights reserved."
    },
    {
        "Date": "2025-02-18",
        "Source Name": "public.com",
        "Source URL": "https://public.com/stocks/mlnk/forecast-price-target",
        "Extracted Text": "MeridianLink Inc. has demonstrated robust revenue growth, particularly driven by the increased volume of home refinancing during the low-interest rate environment influenced by the COVID-19 pandemic. The company is strategically positioning its MeridianLink One connected experience to capture higher shares of customer tech budgets and enhance cross-sell opportunities among its premium client base. Additionally, significant client wins and the recent stock buyback indicate a positive financial trajectory and a commitment to shareholder value, reinforcing the upbeat outlook for the company's future performance. MeridianLink is experiencing a downturn in mortgage-related revenue, which is expected to contribute only 20% of total revenue for the upcoming quarters, indicating a year-over-year decline that highlights challenges within the mortgage market. While non-mortgage-related revenue categories show modest growth, the overall reliance on mortgage-derived income remains a significant concern, compounded by mixed quarterly results and potential pressures on SaaS valuations. Furthermore, the risk of reduced IT budgets may further hinder demand for MeridianLink’s digital transformation products, suggesting that the company's growth trajectory could face substantial hurdles moving forward. MeridianLink (MLNK) Order type Buy in Order amount Est. shares 0 shares AMZN AMD MSFT GOOGL META AVGO NFLX AAPL COIN NVDA TSLA XOM © Copyright 2025 Public Holdings, Inc. All Rights Reserved. Market data powered by Xignite. All investments involve the risk of loss and the past performance of a security or a financial product does not guarantee future results or returns. You should consult your legal, tax, or financial advisors before making any financial decisions. This material is not intended as a recommendation, offer, or solicitation to purchase or sell securities, open a brokerage account, or engage in any investment strategy. Stocks, ETFs, Options, Bonds. Self-directed brokerage accounts and brokerage services for US-listed, registered securities, options, and Bonds, except for treasury securities offered through Jiko Securities, Inc., are offered to self-directed customers by Open to the Public Investing, Inc. (“Public Investing”), a registered broker-dealer and member of FINRA & SIPC. Additional information about your broker can be found by clicking here. Public Investing is a wholly-owned subsidiary of Public Holdings, Inc. (“Public Holdings”). This is not an offer, solicitation of an offer, or advice to buy or sell securities or open a brokerage account in any jurisdiction where Public Investing is not registered. Securities products offered by Public Investing are not FDIC insured. Apex Clearing Corporation, our clearing firm, has additional insurance coverage in excess of the regular SIPC limits. Additional information can be found here. Options. Certain requirements must be met in order to trade options. Options can be risky and are not suitable for all investors. Options transactions are often complex, and investors can rapidly lose the entire amount of their investment or more in a short period of time. Investors should consider their investment objectives and risks carefully before investing in options. Refer to the Characteristics and Risks of Standardized Options before considering any options transaction. Supporting documentation for any claims, if applicable, will be furnished upon request. Tax considerations with options transactions are unique and investors considering options should consult their tax advisor as to how taxes affect the outcome of each options strategy. Options Order Flow Rebates. If you are enrolled in our Options Order Flow Rebate Program, Public Investing will share a percentage of our estimated order flow revenue for each completed options trade as a rebate to help reduce your trading costs. Rebate rates vary monthly from $0.06-$0.18 and depend on your current and prior month’s options trading volume. This rebate will be deducted from your cost to place the trade and will be reflected on your trade confirmation. To learn more, see our Options Rebate Program Terms & Conditions, Order Rebate FAQ and Fee Schedule. Bonds. “Bonds” shall refer to corporate debt securities and U.S. government securities offered on the Public platform through a self-directed brokerage account held at Public Investing and custodied at Apex Clearing. For purposes of this section, Bonds exclude treasury securities held in treasury accounts with Jiko Securities, Inc. as explained under the “ Treasury Accounts” section. Investments in Bonds are subject to various risks including risks related to interest rates, credit quality, market valuations, liquidity, prepayments, early redemption, corporate events, tax ramifications and other factors. The value of Bonds fluctuate and any investments sold prior to maturity may result in gain or loss of principal. In general, when interest rates go up, Bond prices typically drop, and vice versa. Bonds with higher yields or offered by issuers with lower credit ratings generally carry a higher degree of risk. All fixed income securities are subject to price change and availability, and yield is subject to change. Bond ratings, if provided, are third party opinions on the overall bond's credit worthiness at the time the rating is assigned. Ratings are not recommendations to purchase, hold, or sell securities, and they do not address the market value of securities or their suitability for investment purposes. A Bond Account is a self-directed brokerage account with Public Investing. Deposits into this account are used to purchase 10 investment-grade and high-yield bonds. The Bond Account’s yield is the average, annualized yield to worst (YTW) across all ten bonds in the Bond Account, before fees. A bond’s yield is a function of its market price, which can fluctuate; therefore a bond’s YTW is not “locked in” until the bond is purchased, and your yield at time of purchase may be different from the yield shown here. The “locked in” YTW is not guaranteed; you may receive less than the YTW of the bonds in the Bond Account if you sell any of the bonds before maturity or if the issuer defaults on the bond. Public Investing charges a markup on each bond trade. See our Fee Schedule. Bond Accounts are not recommendations of individual bonds or default allocations. The bonds in the Bond Account have not been selected based on your needs or risk profile. You should evaluate each bond before investing in a Bond Account. The bonds in your Bond Account will not be rebalanced and allocations will not be updated, except for Corporate Actions. Fractional Bonds also carry additional risks including that they are only available on Public and cannot be transferred to other brokerages. Read more about the risks associated with fixed income and fractional bonds. See Bond Account Disclosures to learn more. High-Yield Cash Account. A High-Yield Cash Account is a secondary brokerage account with Public Investing. Funds in your High-Yield Cash Account are automatically deposited into partner banks (“Partner Banks”), where that cash earns interest and is eligible for FDIC insurance. See here for a list of current Partner Banks. Your Annual Percentage Yield is variable and may change at the discretion of the Partner Banks or Public Investing. Apex Clearing and Public Investing receive administrative fees for operating this program, which reduce the amount of interest paid on swept cash. Neither Public Investing nor any of its affiliates is a bank. Learn more. Cryptocurrency. Cryptocurrency trading, execution, and custody services are provided by Bakkt Crypto Solutions, LLC (NMLS ID 1828849) (“Bakkt”). Cryptocurrency is highly speculative, involves a high degree of risk, and has the potential for loss of the entire amount of an investment. Cryptocurrencies offered by Bakkt are not securities and are not FDIC insured or protected by SIPC. Your cryptocurrency assets are held in your Bakkt account. Bakkt is a licensed virtual currency business by the New York State Department of Financial Services and a licensed money transmitter, but is not a registered broker-dealer or a FINRA member. Your Bakkt Crypto account is separate from your brokerage account with Public Investing, which holds US-listed stocks and ETFs. Please review the Risk Disclosures before trading. Treasury Accounts. Investing services in treasury accounts offering 6 month US Treasury Bills on the Public platform are through Jiko Securities, Inc. (“JSI”), a registered broker-dealer and member of FINRA & SIPC. See JSI’s FINRA BrokerCheck and Form CRS for further information. JSI uses funds from your Treasury Account to purchase T-bills in increments of $100 “par value” (the T-bill’s value at maturity). T-bills are purchased at a discount to the par value and the T-bill’s yield represents the difference in price between the “par value” and the “discount price.” Aggregate funds in your Treasury Account in excess of the T-bill purchases will remain in your Treasury Account as cash. The value of T-bills fluctuate and investors may receive more or less than their original investments if sold prior to maturity. T-bills are subject to price change and availability - yield is subject to change. Past performance is not indicative of future performance. Investments in T-bills involve a variety of risks, including credit risk, interest rate risk, and liquidity risk. As a general rule, the price of a T-bills moves inversely to changes in interest rates. Although T-bills are considered safer than many other financial instruments, you could lose all or a part of your investment. See Jiko U.S. Treasuries Risk Disclosures for further details. Investments in T-bills: Not FDIC Insured; No Bank Guarantee; May Lose Value. Banking services and bank accounts are offered by Jiko Bank, a division of Mid-Central National Bank. JSI and Jiko Bank are not affiliated with Public Holdings, Inc. (“Public”) or any of its subsidiaries. None of these entities provide legal, tax, or accounting advice. You should consult your legal, tax, or financial advisors before making any financial decisions. This material is not intended as a recommendation, offer, or solicitation to purchase or sell securities, open a brokerage account, or engage in any investment strategy. Commission-free trading refers to $0 commissions charged on trades of US listed registered securities placed during the US Markets Regular Trading Hours in self-directed brokerage accounts offered by Public Investing. Keep in mind that other fees such as regulatory fees, Premium subscription fees, commissions on trades during extended trading hours, wire transfer fees, and paper statement fees may apply to your brokerage account. Please see Public’s Investing’s Fee Schedule to learn more. Fractional shares are illiquid outside of Public and not transferable. For a complete explanation of conditions, restrictions and limitations associated with fractional shares, see our Fractional Share Disclosure to learn more. Investment Plans. Investment Plans (“Plans”) shown in our marketplace are for informational purposes only and are meant as helpful starting points as you discover, research and create a Plan that meets your specific investing needs. Plans are self-directed purchases of individually-selected assets, which may include stocks, ETFs and cryptocurrency. Plans are not recommendations of a Plan overall or its individual holdings or default allocations. Plans are created using defined, objective criteria based on generally accepted investment theory; they are not based on your needs or risk profile. You are responsible for establishing and maintaining allocations among assets within your Plan. Plans involve continuous investments, regardless of market conditions. Diversification does not eliminate risk. See our Investment Plans Terms and Conditions and Sponsored Content and Conflicts of Interest Disclosure. Alpha. Alpha is an experiment brought to you by Public Holdings, Inc. (“Public”). Alpha is an AI research tool powered by GPT-4, a generative large language model. Alpha is experimental technology and may give inaccurate or inappropriate responses. Output from Alpha should not be construed as investment research or recommendations, and should not serve as the basis for any investment decision. All Alpha output is provided “as is.” Public makes no representations or warranties with respect to the accuracy, completeness, quality, timeliness, or any other characteristic of such output. Your use of Alpha output is at your sole risk. Please independently evaluate and verify the accuracy of any such output for your own use case. Market Data. Quotes and other market data for Public’s product offerings are obtained from third party sources believed to be reliable, but Public makes no representation or warranty regarding the quality, accuracy, timeliness, and/or completeness of this information. Such information is time sensitive and subject to change based on market conditions and other factors. You assume full responsibility for any trading decisions you make based upon the market data provided, and Public is not liable for any loss caused directly or indirectly by your use of such information. Market data is provided solely for informational and/or educational purposes only. It is not intended as a recommendation and does not represent a solicitation or an offer to buy or sell any particular security."
    },
    {
        "Date": "2025-02-18",
        "Source Name": "gov.capital",
        "Source URL": "https://gov.capital/stock/MLNK-stock",
        "Extracted Text": "MLNK Price is $18.97 USD today. 1 year MLNK Forecast: $17.184 USD* 5 year MLNK Forecast: $24.56 USD* As of 2025-Feb-18 current price of MLNK is $18.97 and our data indicates that the asset price has been in a downtrend since 2021-Jul-28. Meridianlink Inc has been showing a declining tendency so we believe that similar market segments were not very popular in the given period. Our site uses a custom algorithm based on Deep Learning that helps our users to decide if MLNK could be a bad portfolio addition for the future. These predictions take several variables into account such as volume changes, price changes, market cycles, similar stocks. Future price of the asset is predicted at $17.184 (-9.41%) after a year according to our prediction system.* This means that if you invested $100 now, your current investment may be worth $90.59 on 2026-Feb-18. This means that this asset is not suited as a new addition to your portfolio as trading in bear markets, especially for less experienced traders, is always harder. ALL RIGHTS RESERVED. GOV.CAPITAL"
    },
    {
        "Date": "2025-02-18",
        "Source Name": "money.tmx.com",
        "Source URL": "https://money.tmx.com/quote/MLNK:US/news/8283848710691290/MeridianLink_Inc_MLNK_Q3_2024_Earnings_Call_Transcript",
        "Extracted Text": "2024-11-09 13:52:10 ET MeridianLink, Inc. (MLNK) Q3 2024 Earnings Conference Call November 07, 2024 05:00 PM ET Company Participants Gianna Rotellini - Senior Director-Investor Relations & Strategic Initiatives Nicolaas Vlok - Chief Executive Officer Larry Katz - President Elias Olmeta - Chief Financial Officer Conference Call Participants Cris Kennedy - William Blair Jessica Wang - Raymond James Presentation Operator Ladies and gentlemen, thank you for standing by and welcome to MeridianLink's Third Quarter 2024 Earnings Call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will a question-and-answer session. Please be advised that today's conference is being recorded. I would now like to turn the conference over to your first speaker today, Gianna Rotellini. Gianna, please go ahead. Gianna Rotellini Good afternoon and welcome to MeridianLink's Third Quarter Fiscal Year 2024 Earnings Call. We will be discussing the results announced in our press release issued after the market closed today. With me today are MeridianLink's Chief Executive Officer, Nicolaas Vlok; President, Larry Katz; and Chief Financial Officer, Elias Olmeta. Before we begin, I'd like to remind you that today's conference call will include forward-looking statements based on the company's current expectations. These forward-looking statements are subject to a number of significant risks and uncertainties and our actual results may differ materially. For a discussion of the risks, uncertainties and other factors that could affect our future financial results and business, please refer to the disclosure in today's earnings release and the periodic reports and filings we file from time to time with the Securities and Exchange Commission. All of our statements are made based on information available to us as of today and except as required by law, we assume no obligation to update any such statements.... Read the full article on Seeking Alpha For further details see:"
    }
]